{
    "system": {
        "failInit": "Failed to initialize",

        "d3d": {
            "failCoopLevel": "Failed to set cooperation level",
            "failDisplay": "Failed to get display mode",
            "failDevice": "Failed to create D3D device",
            "failObject": "Failed to create D3D object"
        },

        "dinput": {
            "failCreate0": "Failed to create DirectInput object #0",
            "failCreate1": "Failed to create DirectInput object #1",
            "failDataFormat": "Failed to set data format",
            "failKeyboard": "Failed to initialize keyboard",
            "failQueue": "Failed to queue device",
            "failMouse": "Failed to initialize mouse",
            "failProps": "Failed to set properties"
        },

        "dsound": {
            "failBuffer": "Failed to get DirectSoundBuffer8",
            "failBuffer3D": "Failed to get DirectSound3DBuffer8",
            "failBufferLock": "Failed to lock buffer",
            "failCreateListener": "Failed to create listener",
            "failCreateObject": "Failed to create DirectSound object",
            "failCreatePrimary": "Failed to create primary sound buffer",
            "failCreateTemporary": "Failed to create temporary buffer",
            "failInit": "Failed to initialize DirectSound object"
        },

        "socket": {
            "failInit": "Failed to initialize socket",
            "failPort": "Failed to bind port"
        },

        "replay": {
            "delete": "Delete this replay?",
            "deleted": "Replay deleted.",
            "failFolder": "Failure to create replay folder.",
            "failDelete": "Failed to delete replay.",
            "save": "Save replay?",
            "saved": "Replay saved.",
            "returnSelect": "Returning to select. Save replay?",
            "returnTitle": "Returning to title. Save replay?"
        },

        "netplay": {
            "allowSpec": "Allow spectating?",
            "confirmAddress": " is the address?",
            "confirmMatch": "Play a match? (Select no to spectate)",
            "failConn": "Connection failed.",
            "failSpec": "Spectating is not allowed.",
            "failStart": "Game has not started yet.",
            "failPlaying": "Already playing.",
            "failPlayingSpec": "Already playing. Spectate?",
            "selectAddress": "Connect to address...",
            "selectPort": "Input port number...",
            "selectPrevious": "Connect to previous address...",
            "selectSaved": "Select from saved addresses...",
            "waitHost": "Waiting for connection...",
            "waitClient": "Connecting..."
        },

        "story": {
            "continueConfirm": "Continue?  ",
            "continueLeft": " left."
        },

        "profile": {
            "confirmCopy": " will be copied.",
            "confirmDelete": " will be deleted.",
            "confirmOverwrite": " can be overwritten?",
            "confirmSave": "Save changes?",
            "copied": "Profile copied.",
            "created": " created.",
            "deleted": "Profile deleted.",
            "fail20Cards": "A deck must have 20 cards.",
            "failCreate": " creation failed.",
            "failCopy": "Profile copy failed.",
            "failFolder": "Failure to create profile folder.",
            "failDelete": "Failed to delete profile.",
            "failName": "Name change failed.",
            "nameChanged": "Name changed."
        }
    },

    "csv": {
        "common": {
            "0": {"name": "Spiritual Strike Talisman", "description": "Instantly encloses the surrounding space with a magic barrier. A defensive card that sends nearby enemies flying. Has a long invincibility period."},
            "1": {"name": "Magic Potion", "description": "A magic power restoration drug drawnout of mushrooms from the Forest of Magic. Causes spiritual power to regenerate very quickly and restoresmax spirit power."},
            "2": {"name": "Stopwatch", "description": "A strange pocket timepiece that stops time. During use, attack is not possible. A card for movement."},
            "3": {"name": "Hakurouken", "description": "A youkai forged sword that cuts away hesitation. Interrupts the current action with a dash. An excellent card for covering large amounts of distance quickly."},
            "4": {"name": "Sacrificial Doll", "description": "The damage taken by the possessor will be partially taken by this gratitude evoking doll. The effects are small, but permanent. Multiple uses further increase the effects."},
            "5": {"name": "Grimoire", "description": "A precious book that fills you up with magic power. Permanently increases the rate of spirit orb recovery. Multiple uses further increase the effects."},
            "6": {"name": "Custom Parasol", "description": "A white custom parasol that blocks out the sun. It also acts as a danmaku repelling shield. Forms a defensive barrier to protect against projectile attacks. Actually there is an additional effect but... ?"},
            "7": {"name": "Soul Torch", "description": "A tool from the realms of the dead that summons spirits. Materializes spirits to pursue the enemy. A bullet good for slow pursuit. Even if the original body is hit, they will not disappear."},
            "8": {"name": "Left-handed Folding Fan", "description": "A mysterious folding fan which fillsyou with the power of the youkai of boundaries. Crashes through all obligations to deliver a strike. If blocked, it causes a guard crush, otherwise it does no damage."},
            "9": {"name": "Ibuki Gourd", "description": "The treasure of the Oni from which an infinite quantity of sake flows. Causes card power to swell up, drawing an additional 2 cards. A useful item for drawing attention."},
            "10": {"name": "Tengu Fan", "description": "A Tengu fan that can manipulate the wind. With this, the wind will make the body lighter and more agile. Speed is permanently increased with each use. Multiple uses further increase the effects."},
            "11": {"name": "Spell-Breaking Drug", "description": "A strong poison that inflicts damage upon the soul. Destroys the opponent's top card if it hits."},
            "12": {"name": "A Penny Saved", "description": "Pennies that carry the distance manipulating power of the Shinigami. Causes space to be freed up. The effect is meager, but the card can be used any number of times."},
            "13": {"name": "Divine Raiment of the Dragon Fish", "description": "A dragon fish's wind and lightning repelling divine raiment. Creates an invincible strike that interrupts attacks. Use this when defense becomes difficult."},
            "14": {"name": "Sword of Scarlet Perception", "description": "A celestial maiden's weapon capable of manipulating the weather. Invokes the laws of weather and ends the current weather."},
            "15": {"name": "Illness Recovery Charm", "description": "A charm from the Moriya Shrine that can heal wounds. Heals the body by afixed amount."},
            "16": {"name": "Frozen Frog", "description": "A frog infused with a potent chill. Freezes the nearby ground. Anyone who steps in it will lose their advantageous position and will slip and fall."},
            "17": {"name": "Dragon Star", "description": "A star-shaped hat decoration that fills you with the power of the (so-called) Dragon. Causes your chi energy to swell up. For a short amount of time, receiving a blow will not cause you to falter."},
            "18": {"name": "Control Rod", "description": "Control rods which regulate the energy of nuclear fusion. A double edged sword that permanently increases your attack power but lowers your defense. Plan your use  of nuclear power carefully."},
            "19": {"name": "Three Heavenly Drops", "description": "On the first day of each month, only three drops of this (so-called) mysterious water will fall. On the first and second use, nothing will happen, but on the third?"},
            "20": {"name": "Catfish's Great Earthquake", "description": "The Great Catfish will cause an earthquake to happen in the vicinity. The earthquake is a calamity which hits everything, so caution is advised."}
        },

        "alice": {
            "0": {"name": "Doll \"Semi-automaton\""},
            "4": {"name": "Knight \"Doll of Round Table\""},
            "8": {"name": "Sacrifice \"Suicide Pact\""},
            "12": {"name": "Testing \"Level Titania\""},
            "16": {"name": "Testing \"Goliath Doll\""},

            "100": {"name": "Doll Placement", "description": "Places a doll into position and makes it attack. The position depends on the button used, so it's a basic skill that ties the opponentdown with mines."},
            "101": {"name": "Volatile Doll", "description": "Throws enchanted dolls then backs away. The dolls explode upon being  attacked. At higher levels, the dolls can also be detonated after a time delay."},
            "102": {"name": "Doll Arrangement", "description": "Places several dolls above in waiting, then makes them attack successively."},
            "103": {"name": "Doll Activation", "description": "Leaves C dolls idle for later activation. If you place a lot, you can set up a high-powered wide range attack."},
            "104": {"name": "Returning Dolls", "description": "Fires so that the thrown doll comes back like a boomerang. A direct attack that has speed and power, a rare thing for Alice."},
            "105": {"name": "Doll Cremation", "description": "Throws magically-charged dolls. The projectiles are slow enough for Alice to attack simultaneously."},
            "106": {"name": "Thousand Spear Dolls", "description": "A close-range attack that gathers dolls with weapons and has them jab forward repeatedly. It uses dolls, but it's a melee attack and so cannot be grazed."},
            "107": {"name": "SP Doll", "description": "B button places a doll around you in orbit. C button expends a doll to attack. At most, 3 dolls can be  in orbit, when that happens, B button releases all 3 dolls to attack."},
            "108": {"name": "Doll Ambush", "description": "A technique that allows dolls to hide. The dolls will lie in wait as long as the button is held, and attack on release. The dolls can be attacked by the enemy even if they can't see them, so be careful."},
            "109": {"name": "Edo High-Explosive Pawn", "description": "Throws self-propelled doll grenades. The dolls walk slowly and explode on contact. There can only be one of these on the screen at a time."},
            "110": {"name": "Doll Archers", "description": "A ranged attack that utilizes doll archers who will attack from behind the player. The trajectories of the arrows are scattered, but the arrowsthemselves are dense and cover a wide area."},
            "111": {"name": "Seeker Wire", "description": "Launches a reflecting beam from idle C dolls. The beam passes through all dolls and finally goes flying toward the opponent."},
            "200": {"name": "Magic Sign \"Artful Sacrifice\"", "description": "Throws a magically-charged doll that explodes. Since it's slow, it's hard to land a direct hit, but the power is high for the cost."},
            "201": {"name": "War Sign \"Little Legion\"", "description": "Assemble the dolls into formation and attack. The formation spread outwith time. Though the power is quite limited, it is useful in restricting the opponent's movements."},
            "202": {"name": "Curse Sign \"Shanghai Doll\"", "description": "Shoots a high-output laser from the doll. The delay is short and the range is infinite, so it can be used as a normal shot easily."},
            "203": {"name": "Demonic Control \"Return Inanimate\"", "description": "Throws a doll capable of powerful explosions. Explosion size, power, and speed are increased."},
            "204": {"name": "War Command \"Dolls of War\"", "description": "Creates a dense formation of dolls. If the opponent is trapped inside, they'll be stuck and will take great damage."},
            "205": {"name": "Curse Sign \"Hourai Doll\"", "description": "Shoot lasers from multiple dolls. Covers a wide area in front with high power."},
            "206": {"name": "Spy Sign \"Seeker Dolls\"", "description": "Throws a great number of dolls into the air, which create a net of lasers below them. Its power is directional, so it's tricky, but it's a great way of smoking out the enemy."},
            "207": {"name": "Crimson Sign \"Holland Doll\"", "description": "Releases a doll that fires a cross-shaped laser. You can generally move right after throwing it, so you can use the laser as a shield toinfluence the battle to your advantage."},
            "208": {"name": "Doll \"Futuristic Puppet\"", "description": "Lets you precisely manipulate a single doll. Control it with the arrow keys and attack buttons. You can interrupt control with the D Button."},
            "209": {"name": "Focus Power \"Trip Wire\"", "description": "Fires a beam between you and a doll set with C. If you control their positions carefully, this can be an extremely useful attack that hits right where you want it to."},
            "210": {"name": "Lance Sign \"Cute Phalanx\"", "description": "Many dolls attack the enemy at closerange. Excellent speed and coverage, with pretty good range to boot. A spellcard that was developed as a last resort."},
            "211": {"name": "Dolls \"Lemmings' Parade\"", "description": "Explosive-laden dolls march on the  ground, resulting in a large-scale, long-lasting suppression attack. Destructive power is extremely high, and can potentially mow down the enemy."}
        },

        "aya" : {
            "100": {"name": "Gust Fan", "description": "Creates a gust of wind to attack. The wind heads downwards when cast in air."},
            "101": {"name": "Domination Dash", "description": "A high-velocity forward dash shrouded by the wind. When you're sheltered by the wind, you graze."},
            "102": {"name": "Wind Standing of the Tengu", "description": "Creates a whirlwind in mid-air to stand on so you can jump again. Usable in air only."},
            "103": {"name": "Pelting in the Night", "description": "Calls upon a murder of crows to attack. The attack delay is lengthy, allowing easy coordination. Since they are just normal crows, they flee when attacked."},
            "104": {"name": "Gale Fan", "description": "Scatter cutter-shaped gusts over a wide area. The projectile speed is slower, but the spread is wider. The angle of spread is adjustable."},
            "105": {"name": "Graceful Dash", "description": "A variant of Domination Dash. Loses the graze and speed, but can freely control movement direction."},
            "106": {"name": "Tengu's Downburst", "description": "Rapidly-descending kick attack shrouded in wind. Gusts are created upon touchdown, blowing away all in the vicinity. The type of wind is adjustable. Can be used in mid-air only."},
            "107": {"name": "Wind Sickle Veiling", "description": "Wears a veil of wind, which follows Aya and attacks enemies upon contact. Disappears when moving between the ground and air."},
            "108": {"name": "Wind from the Maple Fan", "description": "A small tornado projectile is shot forwards, and sweeps the opponent into the air. Though it's considereda small attack, it sweeps the opponent fairly high in the air, so it's useful for suppression."},
            "109": {"name": "Tengu Felling", "description": "Fly diagonally upwards while flinging a cluster of wind behind. Can attack the opponent's rear if within an appropriate distance, utilizing the element of surprise."},
            "110": {"name": "Tengu Drum", "description": "Make a leap and stomp on the enemy. If connected, she makes a hop backwards. The arc of the descent can be controlled, allowing follow-up attacks."},
            "111": {"name": "Tengu's Pebbles", "description": "Throws pebbles up into the air usingthe power of wind. Can be recalled anytime to rain down upon the enemy.The more rocks that are thrown upwards, the more rocks come down."},
            "200": {"name": "Whirl Sign \"Maple Leaf Fan\"", "description": "Creates a tornado reaching to the skies. The distance is short, but the caught enemy will be helplessly drawn into the sky."},
            "201": {"name": "Tornado \"Indication to the Divine\"", "description": "Wrap yourself up in a huge tornado. The power is huge and you're invincible, so it's a strong counterattack or attack against enemies in the air."},
            "202": {"name": "Headwind \"Route Forbidden to Man\"", "description": "For a while, wind fills the field and flying objects will strike the enemy. Because it pushes the enemy, they can get herded into one corner of the screen."},
            "203": {"name": "Thrust Sign \"Tengu's Macroburst\"", "description": "A card that can only be used in the air, this card shoots a pressure wave downards. The wave becomes a tornado close to the ground, and traps the opponent within for a longtime."},
            "205": {"name": "Wind Sign \"Wind of the Tengu Path\"", "description": "With one horizontal flash of a fan, fires a simple cyclone."},
            "206": {"name": "Illusionary Dominance", "description": "Knock the enemy upwards, then attack them repeatedly with the ultimate speed. Fly left and right to match the enemy's altitude."},
            "207": {"name": "Wind Sign \"Tengu Limited Special\"", "description": "Uses the power of the wind to greatly increase your speed. The secret to the tengu's speed."},
            "208": {"name": "Crow Sign \"Dark Daymare\"", "description": "A swarm of crows mobs the enemy. The crows obey the crow tengu, but the actual degree of control fluctuates according to her own power and popularity with the birds--- we'll leave that to your imagination."},
            "211": {"name": "Demonic Beast \"Sickle Weasel Veiling\"", "description": "A unique spell that surrounds Aya with a veil of wind, allowing her to attack simply by touching the enemy. Ends when moving between the ground and the sky."},
            "212": {"name": "Squall \"Sarutahiko's Guidance\"", "description": "A stronger and purer version of Domination Dash. Using wind to achieve the maximum accerelation, charge at the enemy with a graze of increased speed and power."}
        },

        "chirno": {
            "0": {"name": "Ice Sign \"Icicle Fall\""},
            "4": {"name": "Cold Sign \"Minus K\""},

            "100": {"name": "Icicle Shot", "description": "Creates icicles and shoots them towards the enemy. They're weak, butholding down the button will make more of them. Attack speed is high, good for pinning down the enemy."},
            "101": {"name": "Midsummer Snowman", "description": "Rolls a ball of ice. The ball continues to grow in size, and hurlsitself at the enemy. Counts as a melee attack during the rolling."},
            "102": {"name": "Little Iceberg", "description": "Forms ice cubes overhead, and throwsthem at the enemy. She can only makethem from her hands, so it's kind oftough for her to use this move whileflying."},
            "103": {"name": "Freeze Touch Me", "description": "Lowers her own body temperature, freezing the air around her. Touch her if you dare."},
            "104": {"name": "Frost Pillars", "description": "Injects a great amount of cold air at her feet and creates large frost pillars that thrust her opponent into the sky. A byproduct of her freezing frogs all the time."},
            "105": {"name": "Ice Charge", "description": "Covers herself with ice and tackles the enemy. A quick, decent skill."},
            "106": {"name": "Icicle Bomb", "description": "Shoots out an unstable low temperature ice block. The block approaches the enemy and shatters. If the hit is good, there'll be a pleasant sound."},
            "107": {"name": "Icicle Lance", "description": "Creates frost pillars at her feet and shoots them into the sky as projectiles. The pillars can hit even as they're being formed. Usefulnot only as anti-air, but also at close range."},
            "108": {"name": "Freezing Light", "description": "Fires a frost beam in three directions. A good, stable all around move, born from the simple idea that \"three is better than one.\""},
            "109": {"name": "Ice Kick", "description": "Goes in for a flying spin kick whilegenerating ice all around. There's actually no need for the spinkick, but she thinks it's cool."},
            "110": {"name": "Frozen Technique", "description": "Shoots out a wave of cold at a short distance, and freezes the enemy. No point in guarding this move. If this move is grazed, Cirno is pretty defenseless."},
            "111": {"name": "Icicle Sword", "description": "Creates a weapon from ice, and usingthat, pierces the enemy. There's a few weapons she can create with ice, but since she has no idea how to usethem, they're pretty useless."},
            "200": {"name": "Ice Sign \"Icicle Machine Gun\"", "description": "Rapid-fires icicles from her hands. They're fast and have good range, but are bad at cancelling enemy shots, so there's a chance that Cirno might be hit by a long-range attack."},
            "201": {"name": "Frost Sign \"Frost Columns\"", "description": "Freezes the entire ground in an instant and stops the enemy cold. Not a powerful move by itself, so comboing is necessary. Use when annoyed."},
            "202": {"name": "Ice Cubes \"Cold Sprinkler\"", "description": "Creates and shoots out a wave of extremely cold ice cubes. The cubes become ice lances, and cut the enemy. It's harder for her to avoid her own attack than use this attack."},
            "203": {"name": "Cold Body \"Super Ice Kick\"", "description": "A spinning kick from the heavens. The longer this attack hits, the more powerful it is, but Cirno gets dizzy after a while. There's really just no reason for her to be spinning..."},
            "204": {"name": "Cold Sign \"Perfect Freeze\"", "description": "Shoots out snowballs on all sides. They freeze in mid air, and then begin moving again after a time delay."},
            "205": {"name": "Ice Sign \"Fairy Spin\"", "description": "Spins in place and creates icicles which shoot out in all directions. Average power, but great range. An attack that was born out of Cirno's desire to hit the enemy in many places."},
            "206": {"name": "Blowing Ice \"Ice Tornado\"", "description": "Spins in place and creates a large ice tornado. The tornado becomes larger with time, and expands towards a specific direction. There's a few seconds of invincibility after this move too."},
            "207": {"name": "Ice Sign \"Sword Freezer\"", "description": "Creates an icicle sword and thrusts towards the enemy. It's hard to create icicles in the shape that she wants, but that's probably because she's dumb..."},
            "208": {"name": "Ice Cubes \"Great Crusher\"", "description": "Beats down the enemy with a huge icecube. It's powerful, got a huge hitbox, and can't be blocked in mid-air. She wanted something that  looked tough, and this is what she came up with."},
            "210": {"name": "Frozen Sign \"Freeze Atmosphere\"", "description": "Attacks with frozen particles created from lowering the temperature. They only do damage at this temperature, but it's pretty annoying to have them stick to you, so you run from them."},
            "213": {"name": "Cold Sign \"Insta-Freeze Beam\"", "description": "Shoots out a powerful freezing beam in three directions. It'd likely be stronger if she had more beams, but four is too much for her, so the beams last longer as a compromise. Can she only count to three?"}
        },

        "iku": {
            "100": {"name": "Dragon Fish's Strike", "description": "A piercing attack that uses her robes wrapped around her arm. A wide-ranging attack with few gaps that focuses mostly on midrange coverage."},
            "101": {"name": "Veils like Water", "description": "Poses, then performs a flowing attack using her robes while guarding. Can nullify projectiles and melee attacks."},
            "102": {"name": "Dragon Fish's Wrath", "description": "Calls thunder from above her and generates lightning, which generates a barrier of electric current and burns nearby enemies. No invincibility, but useful for countering."},
            "103": {"name": "Electrostatic Guided Missile", "description": "Calls lightning to her hand and fires it an the enemy. The lightning is straight, but the smaller bolts can be bent and guided towards the enemy."},
            "104": {"name": "Dragon God's Strike", "description": "Charges surrounding static electricity into her robes and releases it straight forward. Limited range, but hard-to-dodge vertical bolts add to its effectiveness."},
            "105": {"name": "Veils like Wind", "description": "Creates a special turbulence barrier with no attack power, but can deflect bullets. She can use them as offensive weapons depending on how they're deployed. A power of hers, as she can read the winds after all."},
            "106": {"name": "Dragon God's Wrath", "description": "Attacks with a thunderbolt that can be aimed at the enemy's position or your own. You can control the thunderbolt's timing by holding the button down."},
            "107": {"name": "Dragon God's Lightning Flash", "description": "Bends lightning released to the rear towards the enemy. If you're mindful of its limited attack power before it bends, this technique can even shine as a feint or in exchanges."},
            "108": {"name": "Dragonfish, the Able Swimmer", "description": "Synchronizes body movements with the wind. Allows her to move at unthinkably fast speeds."},
            "109": {"name": "The Smite of the Goddess", "description": "Catches the opponent with her shawl in the air and shocks them. She's practiced for a very long time in order to get her shawl to behave the way she wants it to."},
            "110": {"name": "Whiskers of the Dragon God", "description": "A ranged attack that spreads balls of lightning around. You can somewhat control the movement of the lightning with the up and down keys. This lightning can communicate with others like it in dark clouds."},
            "111": {"name": "Dragon's Eye", "description": "A projectile consisting of two glowing orbs with lightning coursing between them. The orbs follow curved paths, so it has a rather complex attack pattern."},
            "200": {"name": "Electric Sign \"Thunder Drum Shot\"", "description": "Gathers up a sphere of electrical energy. After advancing for a moment, it bursts out in all directions."},
            "201": {"name": "Fish Sign \"Dragonfish Drill\"", "description": "Coating the arm in a spiral of electricity, a spell that pierces the enemy with a huge discharge. The reach above and below is very high."},
            "202": {"name": "Lightning Sign \"Elekiter Dragon Palace\"", "description": "Summons a thunderbolt from directly above. Can be used as a protective barrier."},
            "203": {"name": "Star Light \"Light Dragon's Sigh\"", "description": "Accumulates thunder directly overhead. An anti-air technique that delivers a powerful shock to anyone up above."},
            "206": {"name": "Lightning Fish \"Swimming Thunder Shot\"", "description": "Fires a lightning bolt that repeatedly changes direction. While the effect continues, the enemy's movement is restricted. You can use it by itself, but the power is low."},
            "207": {"name": "Angel's Raiment \"Veils like Sky\"", "description": "A technique that wards off enemy attacks. Grants the power to evade attacks while dashing or high jumping, making her very hard to catch. The perfect time to seize the initiative."},
            "208": {"name": "Angel's Raiment \"Veils like Time\"", "description": "Uses her veil to delay the attack of the opponent. If she presses the guard button, she can expend one card in her hand to counter the attack. If she has enough cards, she can enter defense mode."},
            "209": {"name": "Thorn Sign \"Thundercloud Stickleback\"", "description": "A technique that combines attack and defense by surrounding her in an electrical field that shocks any enemy who touches it. The wisdom of living as a thundercloud."},
            "210": {"name": "Dragonfish \"Swimming Oarfish Shot\"", "description": "Shoots electricity out in the shape of a spiral. Your actual body is defenseless, but the electricity takes a defensive role, inhibiting enemy action."},
            "211": {"name": "Orb Sign \"Orb of the Five-Clawed Dragon\"", "description": "Five bolts of lightning trace the shape of a star, and advance in the shape of a claw. This is a very highlevel skill for Dragon's Messengers, the spokes people of the dragons."}
        },

        "komachi": {
            "100": {"name": "Spirits of the Firm", "description": "Sends a spurt of grudging spirits from the ground with a scythe strike. They lay low and float upwards when they detect the enemy."},
            "101": {"name": "Bound Spirits of the Earth", "description": "Excites underground spirits and forces them to burst forth from the earth. After the spirits calm, they float around in a large-area attack."},
            "102": {"name": "Ritual of Ecstacy", "description": "Switches positions with the opponent. Not only a movement or illusion, but can also create chances for attack. No effect during certain moves or in story mode."},
            "103": {"name": "Floating Spirits of the Indolent Dead", "description": "Shoots grudge spirit bullets across the screen. Though slow, they home  in on the opponent with a unique path."},
            "104": {"name": "Scythe of the Reaper", "description": "A slash of the scythe sends a crescent arc forward. Due to its peculiar range, it requires some adjusting to."},
            "105": {"name": "Wind on the Last Journey", "description": "Spins the scythe to slice everything around her. Its wide range makes it eminently useful for hard-to-read counters to linked attacks."},
            "106": {"name": "The Endless Way", "description": "This technique uses her ability to manipulate distance, so it limits horizontal movement inside it. Crossing over it and escaping it once caught is difficult."},
            "107": {"name": "Lonely Bound Spirit", "description": "What seems like a harmless spirit follows the enemy, and explodes when down C is pressed."},
            "108": {"name": "A Human Spirit Passing By", "description": "Strikes the earth with her scythe, creating a ground projectile that travels the entire screen. You can change its direction with different buttons. Good for surprise and simultaneous attacks."},
            "109": {"name": "Boat on the Sanzu", "description": "Charges the enemy with her boat. A boat on land? She doesn't care too much, but since the boat was issued to her and she's wearing it down, her superior gets quite angry with her over this."},
            "110": {"name": "Taste of Death", "description": "It looks like a normal scythe swing, but it can draw the opponent closer in while she's preparing. You can prolong the wind-up by holding the button, which makes it harder to escape the scythe's range."},
            "111": {"name": "Scythe of Exorcism", "description": "Cuts the opponent with her spirit filled scythe. If she touches the spirits that emerge from her scythe after the attack, she can regain some health. She can also cause the spirits to explode."},
            "200": {"name": "Nautical Sign \"Flow of the River\"", "description": "Calls forth a little bit of the Sanzu River water and thrashes the opponent with a boat. Basically a simple charge attack."},
            "201": {"name": "Poor Fate \"Short Life Expectancy\"", "description": "A fearsome skill that cuts the opponent's life in half. Hitting with this skill early in the match is very advantageous, but on the flip side it is very costly so use it carefully."},
            "202": {"name": "Spirit Sign \"Abundant Floating Spirits\"", "description": "A shot that spreads ghosts over a wide area. The attack range is wide and the ghosts stay floating on the screen for a long time."},
            "203": {"name": "Death Song \"Ferriage in the Deep Fog\"", "description": "A skill that leads the ghosts to form into a pack. The ghosts following the lead will naturally become damaging danmaku. It's actually an abuse of power."},
            "204": {"name": "Exchange \"Unpitiable, Pitiable Life\"", "description": "The unprecedented psyche-switching skill. It's possible to turn crisis into opportunity instantly, but this skill doesn't hit easily, is costly, and has a long casting delay."},
            "205": {"name": "Malice Sign \"Irresolute Bound Spirit\"", "description": "Summons powerful, homing spirits. The spirits follow the opponent around but they do not attack. Use this with the explosion trigger technique."},
            "206": {"name": "Death Sign \"Scythe of Final Judgement\"", "description": "Striking the scythe on the ground, a shot will fall on opponents from the sky. Catches the opponent wherever she is but can be easily grazed."},
            "207": {"name": "Soul Sign \"Scythe of Wandering Spirits\"", "description": "Unleashes a blade filled with spirits which steal life from the enemy. The spirits fly back to Komachi and allow her to regain health. According to her, she doesn't use this skill too often."},
            "211": {"name": "Hell \"Narrow Confines of Avici\"", "description": "Slashes at the enemy and prevents horizontal movements at the same time. She can completely control the initiative as long as the effect lasts."}
        },

        "marisa": {
            "0": {"name": "Star Sign \"Eccentric Asteroid\""},
            "4": {"name": "Light Flow \"Shooting Echo\""},
            "8": {"name": "Magic Sign \"Magical R360\""},

            "100": {"name": "Witch Leyline", "description": "Augments the broom with magic and uses it to charge. Marisa's basic critical attack."},
            "101": {"name": "Miasma Sweep", "description": "Catches opponent with the broom and propels them upwards in this anti air attack. There is a little bit of time where Marisa is invincible, so this is a strong close-range attack."},
            "102": {"name": "Grand Stardust", "description": "Throws explosive magic bottles on the ground. Holding the button down will make the bottle go farther."},
            "103": {"name": "Meteonic Debris", "description": "Fires small magic missles, covering a large area. A weakness of this attack is that if not a lot of them hit the enemy, there is little damage done."},
            "104": {"name": "Radial Strike", "description": "Uses the broom as a rifle and turns the flow of Ley Line into bullets. Although it takes a while to fire, the speed and power of the bullets are spectacular."},
            "105": {"name": "Bosky Sweeper", "description": "A magic-enhanced broom sweep. The broom's direct offensive power is gone, but the thrusters have attack power."},
            "106": {"name": "Devildom Torch", "description": "An improved potion that scatters flame about from the point of impact. Its weak point is how its heaviness decreases its flight distance."},
            "107": {"name": "Narrow Spark", "description": "Fires a laser straight ahead. Firing is slow, but it has high piercing power, making it useful in long exchanges of blows."},
            "108": {"name": "Up Sweeper", "description": "A spinning, rising move using broom thrusters. An acrobatic technique where the thrusters also do damage. No invincible frames, but its strong hitbox makes it good for counters."},
            "109": {"name": "Stellar Missile", "description": "Aims straight up and fires a magic missle. The bullet travels a fixed distance and explodes; until then, it has no hit box, but the explosionis long and widespread, so it's useful for controlling the air."},
            "110": {"name": "Magical Reusable Bomb", "description": "The heaviest time bomb. Throws a bomb which then jumps and tumbles. After a while, it explodes with great force, damaging even Marisa."},
            "111": {"name": "Green Spread", "description": "Fires wide-range spread lasers which converge to create a ball of magic energy. The spread lasers haveno hit box, but on the other hand, you don't have to worry about things getting in the way of the blast."},
            "200": {"name": "Love Sign \"Master Spark\"", "description": "When shooting her signature gigantic laser, be aware of the risk of attacks from directions other than straight ahead."},
            "202": {"name": "Magicannon \"Final Spark\"", "description": "This high-output laser has very little space to escape from, direct hit damage and power consumption are both very high."},
            "203": {"name": "Star Sign \"Dragon Meteor\"", "description": "Fires a high-output laser from the sky. Power is high, and you can control the firing angle. Because it takes some time to get into position in the air, it's possible to evade."},
            "204": {"name": "Love Sign \"Non-Directional Laser\"", "description": "Shoots concentrated, powerful lasers forward. Lasers widen with time. Mediocre results follow incorrect usage."},
            "205": {"name": "Magic Sign \"Stardust Reverie\"", "description": "This high-powered charging technique is an upgraded version of Witch Leyline."},
            "206": {"name": "Star Sign \"Escape Velocity\"", "description": "A wide revision of Miasma Sweep. It can be used as a close-range counter or to hit enemies in midair."},
            "207": {"name": "Comet \"Blazing Star\"", "description": "Temporarily leaves the screen, then reenters with a high speed attack that hits almost the entire screen. This unstoppable technique can also be used to escape, but it's slow to start."},
            "208": {"name": "Star Sign \"Meteonic Shower\"", "description": "Fire a large number of scattering shots forward. Fuel consumption is low, so you can use it easily."},
            "209": {"name": "Star Sign \"Gravity Beat\"", "description": "Using the broom as a gun barrel, shoots a magic bullet straight up into the sky, which then falls on the opponent's head and explodes on the ground. The bullet also does some damage on its way up and down."},
            "211": {"name": "Light Sign \"Luminous Strike\"", "description": "Using a broom as a gun barrel, fire a large and high speed magic bullet. It's a different flavor from lasers."},
            "212": {"name": "Light Sign \"Earthlight Ray\"", "description": "Showers the stage with a large number of magic bombs. The bombs hit the ground and fly around in all different directions, but mostly forwards."},
            "214": {"name": "Magical Research \"Deep Ecological Bomb\"", "description": "The ultimate bomb, the product of meticulous research. The bomb explodes after a time delay and can not be blocked. Definitely watch out for splash damage!"},
            "215": {"name": "Ritual Sign \"Orreries Sun\"", "description": "Equips beads held in place by magic. Can be controlled to attack, making them significantly stronger. She can also attack by declaring this spellcard more than once, which makes this move pretty powerful."},
            "219": {"name": "Perversion \"Sure-Fire Master Spark\"", "description": "Using a narrow beam as a conductor, you can amplify the power of a Master Spark. It's possible to attack with an immense blazing power to the front."}
        },

        "meirin": {
            "0": {"name": "Colorful Flip \"Fluttering Petals and Falling Leaves\""},
            "4": {"name": "Colorful Sign \"Vivid Color Downpour\""},

            "100": {"name": "Spiral-Light Steps", "description": "Gathers chi into her arms and punches and stomps the enemy. At high levels, the stomps also do damage."},
            "101": {"name": "Red Cannon", "description": "A chi bomb that directly attacks theupper diagonal. Connecting with the fist also causes damage, so it's a great anti-air and melee move."},
            "102": {"name": "Yellow Quake Kick", "description": "Directs chi towards the earth, and it spreads throughout the ground and attacks. The release and cycling of chi through the earth is of fundamental importance."},
            "103": {"name": "Fragrant Wave", "description": "A semicircle of chi circles and is released as a forward beam. Limited range, but instantaneous. High penetration."},
            "104": {"name": "Searing Red Fist", "description": "First unleashes a high-speed punch and then fires a few balls of chi at the enemy to stop her. Finally, she unleashes one last powerful punch. A move created to suppress and then pummel the enemy."},
            "105": {"name": "Red Energy Release", "description": "Gathers chi into the arms and unleashes a huge attack from her entire body. The first time she tried it, she destroyed the wall of the Scarlet Devil Mansion, so this is an extremely intimidating attack."},
            "106": {"name": "Earth Dragon Wave", "description": "Stomps the ground and deals damage to the enemy with a wave. In Gensokyo, where most battles are aerial, this move sees very little use."},
            "107": {"name": "Water Taichi Fist", "description": "Creates a barrier of chi out of a whirlpool-shaped chi flow, which absorbs all projectile attacks. Her way of caring for the environment."},
            "108": {"name": "Kick of Showering Brilliance", "description": "Attacks overhead with this sweeping arc kick. A mid-level attack, hard to be bested even in mid-air."},
            "109": {"name": "Tiger Chi Release", "description": "Activates all chi within Meiling and makes her attacks stronger. The first hit she lands in this condition is extremely strong and is a counterhit. Becomes more powerful at high levels."},
            "110": {"name": "Sky Dragon Kick", "description": "Using the counter-reaction from stomping the ground, she kicks strongly into the air. With a dragonlike silhouette, this move is one ofher favorites."},
            "111": {"name": "Colorful Rain", "description": "Gathers chi from the surroundings and disperses it around. It should have been dispersed uniformly if one's mind is calm, but because she's always thinking about dinner and such, the paths are random."},
            "200": {"name": "Color Sign \"Colorful Windchime\"", "description": "Using all of her chi, she creates a whirpool and attacks. A very handy and easy invincible attack and a staple of defense."},
            "201": {"name": "Ultimate Color \"Mad Colorful Dance\"", "description": "Whips up a storm using powerful chi from all over her body. Because the chi is strong, she can fly into the sky. Great range, very reliable."},
            "202": {"name": "Chi Sign \"Star Bullets\"", "description": "Releases chi bullets forwards. A fairly standard ranged attack, and the bullets are easy to use because they're large."},
            "203": {"name": "Star Chi \"Earth-moving Star Bullets\"", "description": "Takes a while to create a huge, seven-colored bullet of chi. Even while being created, the bullet has a hitbox. On top of that, it also forms very quickly."},
            "204": {"name": "Attack Sign \"Roc Fist\"", "description": "An all-out attack upwards. Only invincible from the waist up, but has a large hitbox. The enemy falls down quickly, so it's difficult to time, but it is possible to hit the enemy on their way down."},
            "205": {"name": "Fiery Attack \"Roc-Killing Fist\"", "description": "A three-tiered powerful attack. She can power through enemy attacks and still use this move, extremely powerful and able to be linked into, this is one move that can turn the tables completely in a match."},
            "206": {"name": "Rainbow Sign \"Intense Rainbow Fist\"", "description": "A wild, chi-infused attack forwards. The hitbox is fan-shaped and covers the front. If the distance is correct, she can move on the ground and still remain in range."},
            "207": {"name": "Chi Sign \"Earth Dragon Sky Dragon Kick\"", "description": "A flying, seven-colored, chi-filled kick. The kick suspends the enemy inmid-air, and Meiling can continue to hit her. Because of this, the move is slow on startup if you use it close to the enemy."},
            "208": {"name": "Colorful Brilliance \"Rainbow Taichi\"", "description": "A special ranged attack that creates waves of chi that undulate like waves. They are really slow, but spread and limit the enemy's movement."},
            "209": {"name": "Brilliance \"Rainbow Brilliance Palm\"", "description": "Moves a large amount of chi directly into the enemy, then sparks the chi within them with a huge attack. Super effective against demons and undead... not."},
            "211": {"name": "Chi Sign \"Fierce Tiger Energy Release\"", "description": "Explosively raises the level of chi in the body. During this time, all first hits on all combos are treated as counterhits and gain an extremely large attack bonus."}
        },

        "namazu": {
            "0": {"name": "Catfish \"See? The World is Shaking!\""},
            "4": {"name": "Catfish \"The Earth Liquefies into Mud!\""},
            "8": {"name": "Catfish \"I'm Charging Up?\""},
            "12": {"name": "Catfish \"All-Electrical for Ecology!\""},
            "16": {"name": "Great Catfish \"With This Ends the Fleeting World!\""}
        },

        "patchouli": {
            "0": {"name": "Fire Sign \"Ring of Agni\""},
            "4": {"name": "Water Sign \"Princess Undine\""},

            "100": {"name": "Summer Red", "description": "A basic form of fire-element magic. Shoots a large fireball straight ahead. Superb in penetration, damage, and ease of use, but as it  travels straight, it's also easy to dodge."},
            "101": {"name": "Winter Element", "description": "A basic form of water-element magic. Summons a waterway at the enemy's feet and attacks with a high-pressure water spout."},
            "102": {"name": "Spring Wind", "description": "A basic form of wood-element magic. Negates enemy attacks with air pressure and pushes the opponent back, opening some distance between you."},
            "103": {"name": "Autumn Edge", "description": "A basic form of metal-element magic. Uses the metal element to create sharp blades and manipulate them to rush at the opponent. They're not very powerful, but make up for it in number."},
            "104": {"name": "Dew Spear", "description": "A basic form of earth-element magic. Crystal spears erupt from the ground and rain down on the opponent from the sky."},
            "105": {"name": "Summer Flame", "description": "A special form of fire-element magic. Sends flames in a great arc, focusing not on power but on spread. It's not terribly powerful, but dodging it requires lots of movement."},
            "106": {"name": "Condensed Bubble", "description": "A form of water-element magic specialized for defense. A bubble shield that stops enemy attacks. It bursts after taking a certain amountof damage, but that can deal damage back as a sort of counter."},
            "107": {"name": "Flash of Spring", "description": "A form of wood-element magic specialized for offense. Creates a shot of high pressure air and throws it at the opponent. Its high speed makes it hard for those in the line of fire to even avert their eyes."},
            "108": {"name": "Autumn Blade", "description": "An offensively specialized form of metal-element magic. Gathers the metal element to create a circular saw blade, which is thrown at the enemy. When thrown both up and down it's easy to hit with."},
            "109": {"name": "Emerald City", "description": "A defensively specialized form of earth-element magic. Creates a wall of crystal from the earth and sends the opponent flying. Useful as a counterattack as it has invincible frames and a wide attack area."},
            "110": {"name": "Wipe Moisture", "description": "A physical manifestation of fire magic. Lashes fire at the enemy likea whip. Even though she has no strength, and the fire has no mass, it is still incredibly strong."},
            "111": {"name": "Sticky Bubbles", "description": "A restraint device created from water magic. Sprays non-damaging bubbles which trap the enemy in mid-air. The bubbles can not be blocked, but won't have much of an effect unless they all hit."},
            "112": {"name": "Static Green", "description": "Anti-air wood magic. Balls of lightning appear from her hands, shoot upward and explode. Because the basis of this attack is wood magic, it seems that it could be more stable."},
            "113": {"name": "Fall Slasher", "description": "A shapeshifting metal attack. Creates a sword from metal, then throws it towards the enemy. She can also wield the sword while moving by holding down the button."},
            "114": {"name": "Diamond Hardness", "description": "A resistance technique derived from earth magic. The body becomes hard for a while, and can deflect one attack. Defense and attack can get a bit crazy after this move, since she can take a lot of damage."},
            "200": {"name": "Fire Metal Sign \"St Elmo's Pillar\"", "description": "Synthesis of fire and metal. Create a mass with high density and temperature. Strikes the ground and creates a pillar of flame from the enemy's feet. It's easy to misstep."},
            "201": {"name": "Earth Water Sign \"Noachian Deluge\"", "description": "Synthesis of earth and water. Spray compressed water shots forward at low cost, effective in a firefight."},
            "202": {"name": "Metal Wood Sign \"Elemental Harvester\"", "description": "Synthesis of metal and wood. Protects the user with a gear-shaped blade. A defensive spell that can intercept nearby enemies."},
            "203": {"name": "Sun Sign \"Royal Flare\"", "description": "Creates a small sun which burns everything with its light. One of her greatest spells. Destiny-defying magic of the Vampires' mansion."},
            "204": {"name": "Moon Sign \"Silent Selene\"", "description": "Condenses moonlight into arrows of light, shooting through everything in its magic field. Magic that protects Patchouli like an impregnable fortress."},
            "205": {"name": "Five Elements \"Philosopher's Stone\"", "description": "Elemental magic amplifier. When using a special attack, the gems increase its power. Continues with ] the passage of time."},
            "206": {"name": "Water Sign \"Jellyfish Princess\"", "description": "Creates a protective bubble shield. The bubble stops enemy attacks. The user is invincible while the bubble exists, but because you can't graze, it's hard to maintain it for long."},
            "207": {"name": "Moon Wood Sign \"Satellite Sunflower\"", "description": "Independent attack from above. Light shots move upwards in a spiral shape while scattering attacks downwards."},
            "210": {"name": "Sun Wood Sign \"Photosynthesis\"", "description": "Magic from the surrounding area gathers together and heals her. As her spirit replenishes, the benevolent light will follow Patchy around."},
            "211": {"name": "Fire Water Sign \"Phlogistic Pillar\"", "description": "Releases fuses up and down to the ceiling and floor. They have no power until lit with a fire attack, but can be used on ground or in mid-air, and the coverage is quite large."},
            "212": {"name": "Earth Metal Sign \"Emerald Megalopolis\"", "description": "Jeweled pillars rise from the earth and impale the opponent in succession. The speed of this card is quite slow, but the player can exploit this to keep the opponent suppressed for a long time."},
            "213": {"name": "Sun Moon Sign \"Royal Diamond Ring\"", "description": "Whirlpools of light form and attack from the side. They are individually weak, but since they come in succession and have a long duration, it can overwhelm the opponent."}
        },

        "reimu": {
            "0": {"name": "Amulet \"Youkai Repelling Charm\""},
            "4": {"name": "Spirit Sign \"Fantasy Seal -Circle-\""},
            "8": {"name": "Divine Spirit \"Fantasy Seal -Blink-\""},
            "12": {"name": "\"Most Evil Surprise Miko Orbs\""},

            "100": {"name": "Hakurei Amulet", "description": "Fires multiple homing amulets. Increases shots if button is held."},
            "101": {"name": "Cautionary Border", "description": "Generates a long-lasting border by throwing amulets. Can block enemy projectiles. Stuns the enemy if hit."},
            "102": {"name": "Dimensional Rift", "description": "Instantly teleports and strikes at the enemy. Form of attack changes according to the button pressed."},
            "103": {"name": "Ascension Kick", "description": "A somersault kick attack. Wall slams and combos are possible but it renders Reimu vulnerable to attack."},
            "104": {"name": "Youkai Buster", "description": "Fires multiple amulets straight ahead. Rapid-firing with no homing abilities. Good for offensive measures."},
            "105": {"name": "Binding Border", "description": "Creates two borders around the enemy. Restricts enemy movement to the left/right or up/down. Strong against moving targets but disappears if Reimu moves."},
            "106": {"name": "Demon Sealing Dimensional Rift", "description": "Teleports and fires rapid needles ina wide arc. The button used determines the firing direction."},
            "107": {"name": "Sliding Ascension Kick", "description": "Slides into an Ascension Kick. Hard to use as a counter, but the slide extends the reach, so it's good as a linker or mixup."},
            "108": {"name": "Spread Amulet", "description": "Removes the homing from the Hakurei amulets to create a heavy barrage. Since it takes a lot of amulets, it doesn't seem too efficient."},
            "109": {"name": "Permanent Border", "description": "Places a border at her feet. Renders an enemy that steps on it defenseless. If you place more than one, the old one will disappear, so be careful."},
            "110": {"name": "Instant Dimensional Rift", "description": "Creates a body double from amulets to evade attacks. If the double takes a hit, it releases a barrage of amulets. Best used at close range."},
            "111": {"name": "Rain Dance", "description": "Jumps into space and creates a short-range barrier underneath her. There's a lot of variation in this attack, so use it to keep the opponent off balance."},
            "200": {"name": "Spirit Sign \"Fantasy Orb\"", "description": "Fires homing spirit orbs. Since there's enough to easily hit a moving target, it's easy to use in a firefight."},
            "201": {"name": "Divine Spirit \"Fantasy Seal\"", "description": "One of the ultimate forms of the Fantasy attacks. Suppresses the enemy with a huge flood of homing shots. There's almost no blind spot, but its drawback is that it consumes a large amount of energy."},
            "204": {"name": "Dream Sign \"Demon Binding Array\"", "description": "Creates a barrier with Reimu at the center. It's pretty narrow but has avery strong counterattack. Even if she jumps into the air, the barrier remains for a while."},
            "206": {"name": "Divine Arts \"Demon Binding Circle\"", "description": "Creates an expansive barrier centered around Reimu. It's possible to counter since you're invincible."},
            "207": {"name": "Boundary \"Expanding Boundary\"", "description": "Forms damage-dealing boundaries on the four corners of the stage, spreading slowly and evenly like a wave."},
            "208": {"name": "Jewel Sign \"Concealed Orbs of Light\"", "description": "Fires Yin-Yang orbs that bounce off the ground. They last a long time and follow an unusual path, so their effectiveness depends on where they're fired from."},
            "209": {"name": "Treasure Sign \"Ying-Yang Orb\"", "description": "A close-range attack that fires a circular field out from the palm of the hand."},
            "210": {"name": "Holy Relic \"Ying-Yang Sanctifier Orb\"", "description": "A Yin-Yang orb made of immense spiritual energy. Not only is it useful as a direct attack, but the long-lasting after effect is powerful too."},
            "214": {"name": "Divine Arts \"Wind God Kick\"", "description": "A string of Ascension Kicks. It sets up quickly, so there's lots of ways to use it in close combat."},
            "219": {"name": "\"Fantasy Heaven\"", "description": "Upon casting, seven Yin-Yang orbs appear. One lights every time you hit the enemy, when all are lit, a large-scale attack envelops the whole field."}
        },

        "remilia": {
            "100": {"name": "Demon Lord Walk", "description": "Uses her vampiric physical prowess to rush by at blinding speed and attack the enemy."},
            "101": {"name": "Servant Flier", "description": "Uses magic circles to fire bat bullets. The circles' positions are random, but their wide spread and successive firing makes them useful for feints and zoning."},
            "102": {"name": "Demon Lord Cradle", "description": "An aura-wrapped attack to the sky. Though there are many weaknesses, she is invincible for a while, whichmakes this very useful in counters and combos."},
            "103": {"name": "Demon Lord Arrow", "description": "Rushes to the back wall and flies back to attack. The angle of attack is always fixed, but it grazes bullets."},
            "104": {"name": "Vampire Claw", "description": "You can perform this attack up to three times by repeating the input. Very powerful if it hits three times."},
            "105": {"name": "Chain Gang", "description": "Shoots a chain-shaped red aura towards the enemy. The chain tracks the enemy, and if the button is held, it is possible for this attack to change into one that binds the enemy instead."},
            "106": {"name": "Rocket Kick Upper", "description": "Releases a high-speed wedge-shaped bullet from a kick. Defenseless against ground attacks, but is very effective against airborne enemies."},
            "107": {"name": "Ceiling Fear", "description": "Moves towards the ceiling, feints and swoops down for a diving attack on the opponent."},
            "108": {"name": "Trickster Devil", "description": "Blinks in behind the opponent and slices the enemy. Because she has to go behind the opponent, the attack is a bit slow, but you can mix up attack speeds for max effect."},
            "109": {"name": "Demon's Dinner Fork", "description": "Throws magic bundled together in spear form. Charging the attack will increase the number of spears thrown."},
            "110": {"name": "Vampire Kiss", "description": "Hugs the opponent and sucks their blood. Because she has to approach from the front, there's quite a gap. The move can not be blocked and recovers life, so this move can definitely exert pressure."},
            "111": {"name": "Stigmanizer", "description": "Gathers magic and forms a cross, then throws it at the enemy in a jumping attack. Casually forming a cross as if it were nothing is part of her appeal."},
            "200": {"name": "Scarlet Sign \"Red the Nightless Castle\"", "description": "This technique which burns away the surroundings with a red aura can easily be used to turn the tables at a critical moment. It's a spell with a scope that can easily hit mid-air enemies."},
            "201": {"name": "Critical \"Heart Break\"", "description": "Pierces the enemy in an instant with a spearlike aura attack. Aura can be used as a weapon in many ways."},
            "202": {"name": "Midnight Sign \"Demon King Cradle\"", "description": "Directly attack by activating vampiric energies. She's not invincible, but she can move in the air afterwards, so it's a card with great latitudes of freedom."},
            "203": {"name": "Scarlet Devil \"Scarlet Devil\"", "description": "A superior version of Red the Nightless Castle. The damage and attack range are drastically increased. It's definitely a card for a Scarlet Devil."},
            "204": {"name": "Divine Spear \"Spear the Gungnir\"", "description": "Upgraded Heart Break. The spear's size and power are increased. Its speed is like a laser, even at a distance it can pierce the enemy instantly."},
            "205": {"name": "Midnight King \"Dracula Cradle\"", "description": "An attack surrounded by red magical auras. The best counter and combo maker, in terms of speed and range. The cradle of the demon is an express train to hell."},
            "206": {"name": "Midnight Sign \"Bad Lady Scramble\"", "description": "Quickly jumps up the wall, then ramsthe enemy with a spinning body blow. It can easily pierce through a barrage, and the enemy can be confused when you move behind them."},
            "207": {"name": "Destiny \"Miserable Fate\"", "description": "Fire out many chains made from red aura that chase the enemy."},
            "208": {"name": "\"Millenium Vampire\"", "description": "Creates a magical aura that drains life from the opponent on hit. It's very strong, but while its active, her defense is lowered, so it's a double-edged sword."},
            "209": {"name": "Demon \"Remilia Stretch\"", "description": "Mows down the enemy with all her strength. The only way to avoid this move is to move out of range. As shesays, \"Isn't this an elegant move?\" Broken moves are also vampiric in nature."}
        },

        "sakuya": {
            "100": {"name": "Close-Up Magic", "description": "Knives jump around and slash the opponent if she touches them. They fly high and the move grazes, so it's perfect for mid-air attacks."},
            "101": {"name": "Bounce No-Bounce", "description": "Releases knives that bounce against the walls and ceiling. Not particularly powerful, but good for walling off opponents."},
            "102": {"name": "Magic Star Sword", "description": "A knife under the influence of time acceleration. Since it flies straight forward at high speed, it's good at dealing with head-on attacks."},
            "103": {"name": "Vanishing Everything", "description": "Stops time and teleports. Since it's usually hard to tell when she's teleporting, it's useful as a warp technique. She leaves a card behind, which is probably to make it look like her own kind of magic."},
            "104": {"name": "Propelling Silver", "description": "Irregularly throws knives in orbit around her. Can naturally be used as a shield. If the enemy hits the upper edge of the orbit, it's also ahigh-powered attack."},
            "105": {"name": "Square Ricochet", "description": "A bouncing knife effect that focuses on quality over quantity. They have no attack power at first, but they do more damage and move faster the more times they bounce off the walls."},
            "106": {"name": "Sense of Thrown Edge", "description": "Throws knives and then manipulates time to stop them in midair. The knives will resume motion after time passes, or after placing another set."},
            "107": {"name": "Perfect Maid", "description": "After being hit by the enemy, circle back around them and surround them with knives. Since she's concentrating in wait for a physical attack, projectiles will just hit her directly."},
            "108": {"name": "Dancing Star Sword", "description": "Knifes float around and attack in sync, turning into bullets. The type, speed and angle of attacks can change, so this move is a great support during attacks."},
            "109": {"name": "Misdirection", "description": "Throws knives, which then multiply and fly towards the opponent. The knives will try to hit the opponent on the sides, and will catch the opponent off guard as she is attempting to run."},
            "110": {"name": "Parallel Brane", "description": "Throws phantom knives that manifest themselves physically in succession as they move towards the opponent. They disappear if Sakuya performs another attack, but have quite a large range of suppression."},
            "111": {"name": "Time Paradox", "description": "Another Sakuya will appear right in front of the actual Sakuya. If you can input the buttons before she splits bodies, the two bodies will move indepdently. The reason behind this? Parallel universes, etc, etc."},
            "200": {"name": "Illusion Sign \"Killing Doll\"", "description": "Knives scatter outwards, then rush in the direction of the enemy."},
            "201": {"name": "Time Sign \"Private Square\"", "description": "Her specialty, time manipulation. It delays time around her, slowing down the enemy, providing overwhelming offensive and defensive superiority."},
            "202": {"name": "Wound Sign \"Inscribed Red Soul\"", "description": "Hacks the enemy to pieces with knives using both hands. It starts at close range, like a melee attack, but beware its expanding scope."},
            "203": {"name": "Buriallusion \"Phantasmic Killer\"", "description": "A stronger version of killing doll. Knives scatter outwards and bombard the enemy. A very powerful attack."},
            "204": {"name": "Sakuya's World", "description": "One of the strongest time manipulation spells. An unfair spell that completely stops time around her so she can attack, but it's expensive and slow to recover."},
            "205": {"name": "Scarred Soul \"Soul Sculpture\"", "description": "A stronger version of her cutting spell. Power and scope are greatly magnified."},
            "206": {"name": "Silver Sign \"Silver Bound\"", "description": "Simultaneously launches bouncing knives in all directions. Individually their power is weak, but it makes up for it in quantity and range."},
            "207": {"name": "Conjuring \"Eternal Meek\"", "description": "Sends rapid-fire knives forwards. It's said that she's just desperately throwing them, but nobody knows for sure."},
            "208": {"name": "Speed Sign \"Luminous Ricochet\"", "description": "Knife that reflects back and forth across the screen repeatedly. It reflects at full power, so it can pin down enemies for a long time."},
            "209": {"name": "Time Sign \"Sakuya's Special Stopwatch\"", "description": "A technique that throws out time suspension fields. Enemies caught in the field can't move until they leave it."},
            "210": {"name": "Lightspeed \"C. Ricochet\"", "description": "Throws knives at high speed and they attack the enemy after a short time lag. Very hard to spot, and the knives go everywhere, but the last knife is the one that hits."},
            "211": {"name": "Time Sign \"Imaginary Vertical Time\"", "description": "Stops time and throws knife. Knife trails caused by time lag also materialize, and surround the enemy."},
            "212": {"name": "Watch \"Luna Dial\"", "description": "Throws a watch that stops time at the opponent. If it hits, she will be unable to defend Sakuya's attacks for a while."}
        },

        "sanae": {
            "0": {"name": "Snake Sign \"Great Snake Swimming in the Clouds\""},
            "4": {"name": "Miracle \"Miracle of Fafrotskies\""},

            "100": {"name": "Wind-Call", "description": "Calls down a divine wind to the field, and creates a tornado. Not really harmful, but becomes dangerous when it comes into contact with other winds."},
            "101": {"name": "Omikuji Bomb", "description": "Sanae throws omikuji bombs at the opponent, which then deal damage depending on the fortune inside. Since Sanae herself doesn't know what's inside, only god knows what will happen."},
            "102": {"name": "Sky-God Summon: Attack", "description": "A skill that uses Kanako's power. Kanako manifests herself and charges towards the enemy in this standard attack. Pretty easy to use."},
            "103": {"name": "Earth-God Summon: Shield", "description": "A skill that uses Suwako's power. Suwako manifests herself and creates a bubble that protects Sanae. The bubble stays stationary until it has absorbed a set amount of damage or a set amount of time passes."},
            "104": {"name": "Wave-Call", "description": "A ranged skill that creates water waves. The water is weaker the farther away it is from Sanae. The wave extends out as far as it can, cancelling enemy bullets along the way."},
            "105": {"name": "Sky Serpent", "description": "Throws out a charm that becomes a white snake which flies into the sky.However, once the enemy moves, it takes a 90-degree turn and chases the enemy."},
            "106": {"name": "Sky-God Summon: Wind", "description": "A skill that uses Kanako's power. Kanako manifests herself and creates a wind gust on the field. If the wind hits other winds it can move up and down."},
            "107": {"name": "Earth-God Summon: Iron Ring", "description": "A skill that uses Suwako's power. Suwako manifests herself and attacks the enemy directly in a crushing combo move. She's faster than Sanae, so it is possible to move around freely and attack simultaneously."},
            "108": {"name": "Falling Stars", "description": "Stars appear above Sanae's head, and fall towards the enemy. The area covered by this attack is pretty high."},
            "109": {"name": "Cobalt Spread", "description": "Throws charms which then disappear underground and explode in front of the enemy. Since they're underground, they can't be stopped by the enemy, so they're slower as a result."},
            "110": {"name": "Sky-God Summon: Onbashira", "description": "A skill that uses Kanako's power. Kanako manifests herself and rains down onbashira on the enemy. Sanae's impervious during this attack. A very difficult counter to deal with."},
            "111": {"name": "Earth-God Summon: Trap", "description": "A skill that uses Suwako's power. She manifests herself and tunnels underground. If the enemy approaches her, she attacks them like a mine. This move can't be grazed, so it's good for limiting movement options."},
            "200": {"name": "Prayer \"Charm of Good Commerce\"", "description": "Throws a large number of charms at the enemy. Because there are a lot of them, they're not too powerful, but the attack is dense and covers Sanae well, so this skill can be used pretty freely."},
            "201": {"name": "Esoterica \"Grey Thaumaturgy\"", "description": "Projects the shape of a star and attacks the enemy with light. Speed is slow but coverage is good, so the move is a good way to limit the opponent on the ground or in the air."},
            "202": {"name": "Esoterica \"Forgotten Ritual\"", "description": "Creates a giant star-shaped seal which forms an unpenetrable barrier. An excellent defensive skill. A bit slow on the start-up but it creates a long period of invincibility."},
            "203": {"name": "Omikuji \"Random Omikuji Barrage\"", "description": "Shoots out a bunch of random omikuji. Since she has no idea what the results of this attack are until it's over, it could end up hurting her, or it could deal damage disproportionate to its cost."},
            "204": {"name": "Sea Opening \"The Day the Sea Split\"", "description": "Large undulating waves appear. Whilethey're slow, they can hit the enemy even if she is far away, and Sanae can also continue attacking."},
            "205": {"name": "Sea Opening \"Moses' Miracle\"", "description": "A powerful melee spellcard that allow Sanae to rain down blows from above the enemy. She's invincible during and after the attack, but she's vulnerable before the attack begins."},
            "206": {"name": "Miracle \"Mid-Day Supernova\"", "description": "Calls down a bright star above the enemy's head. The star can move up and down, and sprinkle down stardust on the enemy."},
            "207": {"name": "Miracle \"Night of the Supernova Storm\"", "description": "Creates a star-shaped seal which flies towards the sky. A miraculous, hot light beams down from the sky, and covers the upper half of the screen. An all-encompassing anti-air attack."},
            "210": {"name": "Esoterica \"9 Character Pierce\"", "description": "A powerful skill that creates nine boundaries. Severely limits the opponent's ability to move, and as long as they are not touched they will continue to be on the screen, so Sanae can dominate."}
        },

        "suika": {
            "100": {"name": "Spectre -Dense-", "description": "Gathers surrounding heat and releases it in a burst along with a punch. Along with physical damage, the flames act as a projectile."},
            "101": {"name": "Gnome -Dense-", "description": "Manipulates subterranean features to change the landscape. Boulders become lances shooting from the earth, and the rocks are also like punches when they fall back down."},
            "102": {"name": "Spectre -Thin-", "description": "Uses her hair to make copies of herself. Individually, they're weak, but there's lots of them. The attack button determines their movement."},
            "103": {"name": "Gathering Oni", "description": "A black hole that sucks in the opponent. Sits at a fixed distance from the point of firing and obstructs the opponent's movement."},
            "104": {"name": "Oni Spirit Bomb", "description": "Gathers surrounding heat to make a fireball and throws it straight ahead. Charging makes the fireball bigger, you can create quite a powerful attack."},
            "105": {"name": "Gnome -Thin-", "description": "Pounds the earth to awaken earth spirits. The spirits float in the air and damage the opponent on contact."},
            "106": {"name": "Unpleasant Mist", "description": "A mist surrounds Suika and allows her to move freely. Hold down the button, and she can remain in mist form longer, but will leave her immobile for a longer time upon materializing again."},
            "107": {"name": "Thin Oni", "description": "Fires a white hole that releases bullets. The temporary barrage can give you the upper hand."},
            "108": {"name": "Foot Bellows", "description": "Stomps the ground, and sends shockwaves around. She jumps in this attack, so it's very decieving, but it's not very strong."},
            "109": {"name": "Fire Oni", "description": "Hits the ground and makes magma balls erupt. Leveling up this attack makes the magma pebbles more damaging, and the range of this attack greater."},
            "110": {"name": "Ignis Fatuus", "description": "An all-around great skill, fires a fast blue-white ball of flame that tracks the enemy."},
            "111": {"name": "Kidnapping Oni", "description": "Using gravity, draws the enemy towards her, and unconciously uses gravitational forces to throw the enemy far. You can control where she throws the enemy."},
            "200": {"name": "Gather Sign \"Throwing Mt. Togakushi\"", "description": "Gathers all the stones and pebbles around to form a huge rock which she hurls at her opponent. It's slow, but on the other hand, it can't be grazed."},
            "201": {"name": "Drunk Sign \"Art of Oni Binding\"", "description": "Binds the enemy with a chain and damages their spirit power. It doesn't do much damage, but it can pull enemies closer."},
            "202": {"name": "Oni Sign \"Missing Power\"", "description": "Suika becomes huge and scatters everything around her. It wears off right away, but it's enough to scare off approaching enemies."},
            "203": {"name": "Gathering Oni \"Throwing Atlas\"", "description": "Makes a grab at the enemy and throws them tied to a boulder. It can be blocked like regular damage, but you're invincible while you do it."},
            "204": {"name": "Drunken Dream \"Art of Gaki Binding\"", "description": "A special technique that binds an enemy and causes them to lose spirit over time. Since your opponent can't fire at will, you can really influence the game flow."},
            "205": {"name": "Great Oni \"Missing Purple Power\"", "description": "Suika becomes huge and runs amok. You can't block enemy attacks, but you won't flinch, so it's easy to have your way with them."},
            "206": {"name": "Mist Sign \"Gathering and Dissipating\"", "description": "Creates a defensive shield of oni mist that blocks enemy projectiles and follows the opponent around."},
            "207": {"name": "Will-o-wisp \"Superdense Conflagration\"", "description": "Pounds the ground, causing lava to blow upwards. The lava bounces several times, so this has extensive range."},
            "208": {"name": "Oni Sign \"Massacre on Mt.Ooe\"", "description": "Grabs the opponent and slams them into the ground over and over, culminating in an explosion. It's unblockable, but its range requires you to be extremely close."},
            "212": {"name": "Secret of Kings \"3-Step Destruction\"", "description": "Suika becomes huge and throws consecutive punches at the enemy. This move is full of defensive holes so be prepared before you take this gamble."}
        },

        "suwako": {
            "0": {"name": "Clap \"Daidarabotchi's Worship\""},
            "4": {"name": "Divine Tool \"Moriya's Iron Ring\""},
            "8": {"name": "\"Hellish Heat Geyser\""},
            "12": {"name": "\"Magma Amphibian\""},
            "16": {"name": "\"Divine Battle Above Gensokyo\""},

            "100": {"name": "Ancient Geyser", "description": "An attack that spews water from Suwako's feet. She rides the water and attacks from the air."},
            "101": {"name": "Toad God", "description": "Shoots out a frog-like aura. The silhouette itself can't be hit but can be used to restrain the enemy, so it's useful in melee combat. Can be used below or above ground."},
            "102": {"name": "Lake of Great Earth", "description": "A diving attack towards the earth. Tackles the enemy and damages the area. Can also be used underground to catch the enemy off guard."},
            "103": {"name": "Native Scourge", "description": "Using the power of Mishaguji, the scourge god, shoots out homing clouds. They're weak but they can curse the enemy with adverse effects if they hit. At high levels, they'll curse even when guarded."},
            "104": {"name": "Frog God", "description": "A water frog springs from Suwako's hat and bounces on the ground towards the enemy. Explodes when near. Because the frog is slow, it is possible to attack while it is moving."},
            "105": {"name": "Ancient Metal Ring", "description": "Spins a light-infused metal ring around, and attacks the enemy. Can be used in the air or on the lily, and is an extremely useful anti-air move."},
            "106": {"name": "Ancient Jade", "description": "Collects jades from underground and shoots them as high-speed projectiles. Short delay before firing, but a powerful attack that can be used both above and below ground."},
            "107": {"name": "Blighted Earth", "description": "Mishaguji's power springs forth from Suwako's feet, creating a vortex of cursed energy, which will affect the enemy. Can be used underground or standing up."},
            "108": {"name": "Rain-Calling Frog", "description": "Brings down rain sprinkler-style from overhead. Projectiles are dense and cover a great range. A pretty normal attack, comparatively."},
            "109": {"name": "Ms Longlimbs", "description": "Four aimed beams of light shoot out from each of Suwako's limbs. Can only be used in mid-air, but the attack covers a very large area."},
            "110": {"name": "Stone Frog God", "description": "Rides a frog-shaped boulder from underground and thrusts into the enemy. Pretty strong attack, and if done correctly, can't easily be countered. If used in midair, she warps underground and then attacks."},
            "111": {"name": "Mishaguji Scourge", "description": "In return for not being able to use Mishaguji's powers for the duration of the match, this move imparts a permanent penalty on the enemy which lowers their defense at certain times."},
            "200": {"name": "Native God \"Moriya God\"", "description": "A giant frog aura surrounds Suwako and attacks the enemy. Immune to attacks and fast. Good hitbox, also usable for defensive purposes."},
            "201": {"name": "Spring Sign \"Moriya Clear Water\"", "description": "A spellcard that drowns the enemy in water. A good projectile attack that can be used above the ground."},
            "202": {"name": "Party Start \"2 bows, 2 Claps, 1 Bow\"", "description": "A giant stone hand appears and squishes the enemy in a pincer attack. Can be used as a surprise attack underground but beware--- there are large gaps."},
            "203": {"name": "Native God \"Froggy Braves the Elements\"", "description": "Shoots out a flurry of water bulletsfrom her hands. After a period of time, they rain down upon the enemy."},
            "204": {"name": "Divine Instrument \"Moriya's Metal Ring\"", "description": "Throws metal rings that jump around inside the screen. Releases three of them, so there's not really a lot of places to run. It's a wonderful skill, but note that the rings will disappear if Suwako is hit."},
            "205": {"name": "Spring Sign \"Horrid River Jade\"", "description": "Unleashes a torrent of water from the back of the screen. For her, who governs the earth, bending rivers is a piece of cake. If she's performing at her best, that is."},
            "206": {"name": "Frog Hunt \"Snake Hears And Eats Frog\"", "description": "A snake-shaped boulder springs from the ground and devours the enemy. Has a slow startup but can't be airblocked. For a frog god to be using a snake-like attack... is this her competing with Kanako?"},
            "207": {"name": "Native God \"Master Longlimbs\"", "description": "Beams godly power from her limbs. There are no gaps other than the sides, so it's an unbeatable attack, but can only be used in mid-air."},
            "208": {"name": "Scourge God \"Mishaguchi-sama\"", "description": "The scourge god obeys Suwako, and spreads curses around to the enemy. Can't escape once caught."},
            "209": {"name": "Native God \"Red Frog of Houei 4\"", "description": "Splits and attacks the enemy. She can't move for a while, but her split bodies chase the enemy around."},
            "212": {"name": "Frog Nap \"Can Always Hibernate\"", "description": "Only usable underground, sleep and recover health. Highly vulnerable, so use an underground move to confuse. This all depends on your deck and how well your enemy can read your moves, though."}
        },

        "tenshi": {
            "100": {"name": "Sword of the Earth", "description": "Drives spirit into the earth, making it rise. Powerful and wide-range, but useless against airborne enemies."},
            "101": {"name": "Pillars of Divine Punishment", "description": "Drops a keystone from the heavens. After leveling-up, the stone will serve as a defensive wall, and have strong defensive capabilities."},
            "102": {"name": "Beams of Non-Perception", "description": "Fires successive laser-like streams of spirit from a keystone. Very useful as an anti-projectile piercing attack."},
            "103": {"name": "Sword of Non-Perception", "description": "Rushes forward, attacking with the Sword of Scarlet Thought. The rush grazes, so you can force your way through danmaku."},
            "104": {"name": "Six Earthquakes -Signs-", "description": "Plunges the Sword of Scarlet Thought into the earth to cause a localized earthquake. Always affects opponents on the ground, but does nothing against airborne enemies."},
            "105": {"name": "Guarding Keystones", "description": "Uses keystones circling her to protect her. If you input the command again while they're deployed, the keystones fly towards the enemy."},
            "106": {"name": "Heaven and Earth Press", "description": "Crushes the enemy between two stones. You can adjust the distance they fly by holding the button."},
            "107": {"name": "Sword of Scarlet Perception", "description": "Blindly swings the Sword of Scarlet Thought around. The range is small, but the attacks are rapid, so this is a great move for close range. Continuous pressing of the button results in a continuous attack."},
            "108": {"name": "Sword of Fate", "description": "Throw the Sword of Scarlet Thought with a hearty flick, and it returns like a boomerang or when she uses another sword attack. If she catches it normally, there will be a moment of weakness, so watch out."},
            "109": {"name": "Awakening of the Earth Spirits", "description": "Pelt the enemy with small keystones. The stones grow over time, and release an earthquake if Tenshi attacks it. The bigger the stones, the stronger the earthquake, but will shatter if they get too big."},
            "110": {"name": "Scarlet Sword Temperament", "description": "Using the Sword of Scarlet Thought, control the temperaments and attack twice: once with a ranged attack that brings her closer to the enemy, and another attack that propels her away from the enemy."},
            "111": {"name": "Sky Attack", "description": "Launch upwards surrounded with temperament, fully utilizing the tough, hardened body of celestials. She is invincible from the start, and can use it in the air as well."},
            "200": {"name": "Earth Sign \"Sword of Unletting Soil\"", "description": "Infuse temperaments into the terrain and create big lumps that attack left and right. As the lumps travel slowly, the skill itself offers few gaps to be attacked."},
            "201": {"name": "Non-perception \"Sword of Rapture\"", "description": "A power of the Sword of Scarlet Thought. Using a temperament seal spell card, make the afflicted opponent unaffected by the weather for some time, creating moments of meteorological advantage."},
            "202": {"name": "Heaven Sign \"Sword of Divine Justice\"", "description": "Charge upwards with the Sword of Scarlet Thought. Missing the target would leave you in a despairing gap, but that's needed to balance the otherwise invincible technique."},
            "203": {"name": "Earthquake \"Sword of Worry and Joy\"", "description": "Stab the sword into the ground to induce tectonic movements. A delayed earthquake comes to damage enemies on the ground. There's nowhere to run on the ground, but there is time to escape to the sky."},
            "204": {"name": "Temperament \"Meteorological Revelation\"", "description": "A power of the Sword of Scarlet Thought. Manipulate the temperaments, gather them at the sword, then release them. A high-power spell that disrupts the climate, ending the current weather."},
            "205": {"name": "Keystone \"World Creation Press\"", "description": "Taking to great heights above the screen, Tenshi descends onto the opponent with an enlarged keystone in her arms. A wanton technique."},
            "206": {"name": "Temperament \"State of Enlightenment\"", "description": "For a limited period of time, strengthen the body to withstand hits without entering hitstun, but cannot guard while the effect lasts. She's actually just breathing in to withstand the pain."},
            "207": {"name": "\"Scarlet Weather Rapture\"", "description": "A grand technique that concentrates the surrounding temperaments at the Sword of Scarlet Thought and unleashes them below. Beware that this uses all of the surrounding temperaments."},
            "208": {"name": "Swordplay \"Sword of Swagger\"", "description": "Swing the Sword of Scarlet Thought around blindly, cutting the enemy into pieces. There's a lot of slicing and dicing in this attack, but not much else, so it's a bit weird to call it a \"skill\"."},
            "209": {"name": "Weather \"Scarlet Weather Pressure\"", "description": "Shoot temperaments at the enemy in this ranged attack. If it hits the enemy, the temperament expands and changes the current weather."}
        },

        "udonge": {
            "100": {"name": "Mind Explosion", "description": "Fires rocket-shaped bullets that release spiritual energy on impact. The bullets are low-speed, but the exploding effect makes them useful in barrages."},
            "101": {"name": "Illusionary Blast", "description": "Attacks with the insanity wavelength directly ahead. Since it's much like a so-called laser attack, it has high penetration ability."},
            "102": {"name": "Ultrared Field", "description": "Manipulates the waves around her, making it such that the enemy can't tell where she is. Her specialty is hiding out of sight using wave manipulation."},
            "103": {"name": "Disbelief Aspect", "description": "Projects an illusion on a different wavelength. The illusion attacks differently depending on your inputs. Since the illusion moves like her, it has a sort of deceptive effect."},
            "104": {"name": "Mind Bending", "description": "Fires shots over a wide range. They're fast and easy to hit with, but there are inconsistencies in its power."},
            "105": {"name": "Eyesight Cleaning", "description": "Marks an area in her line of vision that expands as you hold the button. If the enemy is in that area when you let go, they will be momentarily seized by a glance of madness."},
            "106": {"name": "Ultraviolet Field", "description": "Creates a field with a wavelength that makes the enemy go crazy. The enemy will see illusions, and be attacked by these hallucinations."},
            "107": {"name": "Disorder Eye", "description": "Sends several clone images around. The spread-out dummies then regroup where they split off while damaging the enemy. The real Reisen is invincible before the images all regroup."},
            "108": {"name": "Mind Dropping", "description": "Fires a bullet towards the sky, which explodes and falls. The warhead itself won't hit, but the explosion can be delayed by holding down the button. Can be used in combination with regular bullets."},
            "109": {"name": "Ripple Vision", "description": "Fires a ring-shaped eye beam. The beam expands over time, so avoiding at a distance is difficult."},
            "110": {"name": "Undersense Break", "description": "An eye wave that deals damage at close range. Useful as a simple attack or defense, and easy to use in direct combat."},
            "111": {"name": "Acura Spectral", "description": "The enemy sees various illusions while Reisen dashes. The point of reappearance can be chosen with the arrow keys before dashing."},
            "200": {"name": "Charming Look \"Corolla Vision\"", "description": "Fires rings which become enormous with distance. Cheap, but wide-range. Easy to use carelessly as fake-outs and such."},
            "202": {"name": "Illusion Bomb \"Mind Starmine\"", "description": "A sniping spell card that fires spiritual explosions in every direction. The bullets explode after a delay, pinning down every direction at once."},
            "203": {"name": "Fascination \"Crown Vision\"", "description": "A spell that releases rings that get larger as they get farther out at high speed."},
            "204": {"name": "Red Eyes \"Lunatic Blast\"", "description": "Sends strong ESP waves skyward in this wide-range attack. This was used originally to communicate with moon rabbits, but that function will probably never be used again."},
            "205": {"name": "Lunatic Red Eyes", "description": "Releases swirls of light at a wavelength that forces the opponent into madness. It has extensive range and power, with setup time to match."},
            "206": {"name": "Weak Heart \"Demotivation\"", "description": "Pummels the enemy with lunacy waves from a short distance, causing one of the opponent's cards to disappear. In addition, the opponent is confused and can't use special attacks for a little while."},
            "207": {"name": "Desolation \"Discarder\"", "description": "Fires mentally-damaging bullets. If they hit, two cards are destroyed and the opponent falls into confusion, unable to use cards. A great supporting move in battles."},
            "208": {"name": "Poison Smokescreen \"Gas-Woven Orb\"", "description": "A drug that reacts with air and becomes gas. Since the gas is heavier than air, it sticks to the ground and sucks the life out of opponents. Reisen herself has taken the antidote already."},
            "209": {"name": "Life Elixir \"Grand Patriot's Elixir\"", "description": "Takes a dose of the Eirin Brand enhancer. Attack and defense power increase with each dose. Something happens if you take too much, but nobody told Reisen about that."},
            "210": {"name": "Shortsight \"X-Wave\"", "description": "A wave that will make the enemy insane. She will see hallucinations of Reisen, and will receive damage from these hallucinations."},
            "211": {"name": "Farsight \"Infrared Moon\"", "description": "Unleashes waves of madness, throwing the enemy into utter mental chaos, unable to tell where Reisen is. Reisen doesn't really contact other people, so she seems to use this move in real life pretty often."}
        },

        "utsuho": {
            "0": {"name": "Heat Sign \"Break Prominence\""},
            "4": {"name": "Atomic Fire \"Uncontainable Nuclear Reaction Dive\""},
            "8": {"name": "\"Hot Jupiter Descent Model\""},
            "12": {"name": "Atomic Fire \"Artificial Sun's Spot\""},

            "100": {"name": "Flare Up", "description": "Shoots nuclear radiation around, which then ascends in a helix and burns enemies. At high levels, Okuu herself also becomes a hitbox."},
            "101": {"name": "Ground Melt", "description": "Sears the ground using her control rod. The actual heat wave has no hitbox, but the ground explodes in this attack."},
            "102": {"name": "Break Sun", "description": "Creates a sun-like object above her head, and pulses light particles at the enemy. Holding the button down will make the attack stronger."},
            "103": {"name": "Shooting Star", "description": "Moves diagonally upwards and leaves a trail of energy balls behind her. They begin moving outwards after a short time delay. She has no idea she's attacking, she just thinks she's moving."},
            "104": {"name": "Rocket Dive", "description": "Propels herself forward using nuclear fusion and attacks. Huge hitbox and extremely powerful, but she's quite exposed after she moves off the screen, which is a problem."},
            "105": {"name": "Hell Geyser", "description": "Creates a nuclear reaction underground and shoots the energy diagonally upwards at the enemy. Can also shoot towards the enemy from the back, so it's quite easy to try to use this skill in chains."},
            "106": {"name": "Shooting Sun", "description": "Collects nuclear energy over her head and throws it at the ground. She can collect energy for as long as she wants, and the projectile is not affected by other bullets until it explodes."},
            "107": {"name": "Retro Atomic Model", "description": "An energy ball spins and follows Okuu. The ball itself can be used as a shield or a weapon, and is an excellent tool for Okuu, whose moves are usually very wide and sweeping."},
            "108": {"name": "Melting Pummel Kick", "description": "Pins down the enemy and stomps her with her left foot, infused with fission energy. The move is a kind of throw, so can't be blocked, the enemy is at Okuu's mercy."},
            "109": {"name": "Radiant Blade", "description": "Charges up energy until she gets close to the enemy and then fires it at her. A move between a charge and a projectile, useful for whittling down the opponent's spirit."},
            "110": {"name": "Hell Wave Cannon", "description": "Unleashes waves of light, then gathers and points them to fire in any direction she wants. Holding down the button concentrates fires and makes the attack as powerful as possible."},
            "111": {"name": "Vengeful Nuclear Spirits", "description": "The B button places a nuclear marker. The C button unleashes a wave of energy from the markers using Okuu as a vertex. If you move after the attack starts, the energy waves will adjust accordingly."},
            "200": {"name": "Explosion Sign \"Mega Flare\"", "description": "Collects nuclear energy and fires. Avery simple and high-powered move, virtually impossible to erase from the front."},
            "201": {"name": "Explosion Sign \"Giga Flare\"", "description": "Collects a huge amount of nuclear energy and burns everything in frontof her. Extremely powerful with a huge range, but Okuu is completely exposed from the back."},
            "203": {"name": "Burning Star \"Fixed Star\"", "description": "Throws a ring of nuclear energy at the opponent. The energy ring moves backwards after a while, and hits the enemy a second time."},
            "204": {"name": "Burning Star \"The Ten Suns\"", "description": "A ball of nuclear energy attacks along a set path. Covers to the top of the screen so can also be used for defense."},
            "205": {"name": "Nuclear Sign \"Creeping Sun\"", "description": "Creates a nuclear reaction in the sky and sun-like projectiles shoot down from the heavens as a result of the nuclear reactions."},
            "206": {"name": "\"Hell's Artificial Sun\"", "description": "Creates an energy mass that has gravity, and shoots it forwards. She will continue to inject energy into this mass. This massive attack uses up all the cards in her hand."},
            "207": {"name": "Geothermal \"Nuclear Blaze Geyser\"", "description": "Infuses the ground with nuclear energy, turning the ground to magma and spewing it everywhere. New magma spouts erupt from locations where magma landed."},
            "208": {"name": "Light Energy \"High-Tension Blade\"", "description": "Creates a blade-like energy beam from Okuu's control rod. Limited range, but if used at close range, the move covers quite a large area. She sometime uses this as a big flashlight... seriously now?"},
            "209": {"name": "Crow Sign \"Yatagarasu Dive\"", "description": "A fusion reaction occurs within Okuu, and a silhouette in the shape of a brilliantly shining bird attacks the enemy. A skill that shows the true spirit of the hell crow."},
            "210": {"name": "Nuclear Heat \"Uncontrollable Dive\"", "description": "Propels herself using a massive amount of fusion energy in this massive attack. Races back and forth across the screen many times to hit the enemy in multiple places."},
            "211": {"name": "Control \"Self Tokamak\"", "description": "Fusion energy surrounds Okuu and activates when she flies or dashes forward towards the enemy. Requires precision, so a bird-brain like Okuu can't think of any other attacks when attempting to use this one."},
            "212": {"name": "\"Subterranean Sun\"", "description": "Draws energy from the earth and creates a sun on the spot. The sun manifests itself and burns everything in the surrounding area."},
            "213": {"name": "Light Cover \"Nuclear Visor\"", "description": "Creates a barrier in front of herself, which can take a few attacks. Will continue to be in front of Okuu until a certain amount of time passes."},
            "214": {"name": "\"Abyss Nova\"", "description": "A nuclear chain reaction occurs within Okuu and destroys everything in sight once critical mass is reached. The explosion has a large hitbox and can not be blocked. An intense skill, even for her."}
        },

        "youmu": {
            "100": {"name": "Netherworld Reflection Slash", "description": "Creates a projectile-reflecting barrier with the Hakurouken. Has no offensive properties but reflects over a wide area."},
            "101": {"name": "Crescent Moon Slash", "description": "Counterattack with a slash of the Roukanken. The invincible upward slash is useful for anti-air or interruption."},
            "102": {"name": "Slash of Life and Death", "description": "A successive attack that develops if you input it multiple times."},
            "103": {"name": "Medium's Bind", "description": "Sends her ghost-half flying at the enemy. If it hits, it will stay close to the enemy."},
            "104": {"name": "Lotus Stance Cut", "description": "A standard sword-magic technique. It has good range and power, offsetting Youmu's usual strength in melee."},
            "105": {"name": "Intolerant Avici", "description": "A rare throw move that breaks her stance to grab the opponent. You have to be close, but it's impossible to guard so it's easy to pull off."},
            "106": {"name": "Heart Carving Cut", "description": "Covers great distance to strike at the opponent. Since it aims for the feet, it's a low attack."},
            "107": {"name": "Wicked Soul", "description": "Her ghost half glows and attacks. Since it attacks from wherever you are, you have to put thought into making it hit."},
            "108": {"name": "Phosphoric Slash", "description": "A short-range attack that unleashes a burst of energy from Youmu's sword. Even when it returns it hits the enemy, so it's a good skill for short-range attackers."},
            "109": {"name": "Insightful Sword", "description": "Stops direct attacks with Hakurouken and cuts down the opponent with Roukanken. Perhaps Youmu's most powerful attack."},
            "110": {"name": "Slashing a Flower Upon One's Head", "description": "Jumps above the enemy and slashes down with all her might. Even if the enemy guards, it's a good move, and Youmu can exert massive pressure on the opponent from above."},
            "111": {"name": "Strange Half-Body", "description": "Fires projectiles from her ghost half. The ghost has to recover for a bit, but it's easy enough to use with other attacks."},
            "200": {"name": "Human Sign \"Slash of Present\"", "description": "Step forward and cut the enemy. It's hard to hit an enemy in the air, but it's very powerful in a ground battle."},
            "201": {"name": "Life Ending Sword \"Meditation\"", "description": "Using a sword as a medium for destructive power, cuts with a huge sword made of light. A spell based on the power of the sword."},
            "202": {"name": "Soul Sign \"Ghostly Wheel of Pain\"", "description": "The Half-body traces behind the real body, copying its attacks. Power is reduced, but the attack is slightly delayed, allowing you to reduce the gap between attacks."},
            "203": {"name": "Obsessor \"Slash of Eternity\"", "description": "Rush in to cut the enemy, suspend them in midair and dance around them, attacking repeatedly. Power is high and you're temporarily invincible, attacking and defending perfectly at the same time."},
            "204": {"name": "Enlightened Sword \"Rise from Delusion\"", "description": "Putting a huge amount of energy into the sword, create an immensely destructive blade and mow down everything in front. Very hard to dodge."},
            "205": {"name": "Spirit \"Secret of Life and Death\"", "description": "The Half-body separates and traces Youmu's attacks. Expenditure is high, so the usage time is long."},
            "206": {"name": "Sword Skill \"Thousand Cherry Blossoms\"", "description": "Move forward at high speed, cherry blossoms flashing above your path. A beautiful technique refined from time spent pruning the gardens."},
            "207": {"name": "Soul Cutting \"Ascension to Nirvana\"", "description": "Crossing both swords, create a pillar of energy reaching into the sky. Has practical uses as an anti-air, counter, or combo attack."},
            "208": {"name": "Empty Perception \"6-root Cleansing\"", "description": "Cut the enemy with Hakurouken, and then use quick footwork to rush the enemy in this massive attack."},
            "212": {"name": "Reincarnation Sword \"Sword of Cycles\"", "description": "Deals repeated high-speed hits using Roukanken, and overwhelms the enemy while remaining invincible. A strong attack with very fast activation."}
        },

        "yukari": {
            "100": {"name": "Open, Lamented Box of Urashima", "description": "Opens a gap from the sky and drops debris from it to cause damage."},
            "101": {"name": "Ghostly Butterfly Hidden in Zen Temple", "description": "A melee attack that attacks by whirling the umbrella. There is no invincible period, but its hitbox is wide."},
            "102": {"name": "Ride the Waves, Fight the Ocean", "description": "(B) opens up a hole that sucks in projectiles. The sucked-in objects are stored, and can be shot out with force using (C) 'Fight the Ocean'"},
            "103": {"name": "Illusional Rift", "description": "Take refuge inside a gap, then appear from the exit while attacking. The dash button and key input allows you to control the form of the attack and where to emerge."},
            "104": {"name": "Bound to the Grave", "description": "Blasts out debris from a gap in a fan shape which spreads out. Becomes a diversion at medium range."},
            "105": {"name": "Illusion Manji Parasol", "description": "Spirit power is converged into a manji on the umbrella, which is spun into a projectile. Its large hitbox makes it useful for zoning. Charging it delays its release, but it's harmless before it's fired."},
            "106": {"name": "Universe of Matter and Antimatter", "description": "Places a gap that has no effect whatsoever. When two of these gaps come in contact with each other, a reaction occurs, which causes a huge distortion attack."},
            "107": {"name": "Flesh Dismantler", "description": "Disappear into a gap and fly out, attacking the opponent. Holding the key will allow her to hide for a while longer and move left and right."},
            "108": {"name": "Bewitching Bait", "description": "Creates a birds-eye through which high-speed flying objects are released. Its position is fixed, but the projectiles' paths are random."},
            "109": {"name": "Border between Brains and Feet", "description": "Yukari runs straight along the border, pulls high-powered objects from it and unleashes them upon the enemy. This just proves that you can always split something even smaller."},
            "110": {"name": "Eye of Changes", "description": "An eye from the gap targets the enemy. It becomes a stationary platform that offers supporting fire. It follows a designated path, so it can be regarded as one of Yukari's familiars."},
            "111": {"name": "Wings of the Chimera", "description": "Places a gap door that can be used to teleport when needed. Very fast speed, usable freely for escape and easy to carry around."},
            "200": {"name": "Border Sign \"Quadruple Barrier\"", "description": "Creates multiple barriers in front, attacking the enemy at short range. The move is quick so you can chain it to other moves, making it a staple in close-range combat."},
            "201": {"name": "Shikigami \"Ran Yakumo\"", "description": "Summons Ran and gives her the attack command. Ran charges straight ahead, and adds damage with her spinning attack if she catches the enemy."},
            "202": {"name": "Boundary \"Border Between 2D and 3D\"", "description": "A unique skill that creates a boundary running along the screen edge. It changes directions to follow the screen. You can also fire it behind you by holding back."},
            "203": {"name": "Boundary \"Charming Quadruple Barrier\"", "description": "A larger version of Quadruple Barrier that also sucks the opponent in, making its effective range much greater."},
            "204": {"name": "Shikigami \"Chen\"", "description": "Borrows Ran's shikigami Chen for a while. Chen bounces across the screen and attacks the enemy indirectly, unlike Ran. Being a low level shikigami, her cost is low too."},
            "205": {"name": "Boundary \"Objective Border\"", "description": "Fires four linked boundaries that traverse the edges of the screen. Since it affects most of the screen, it leaves little safe room for the enemy."},
            "206": {"name": "Fantasy Nest \"Nest of Fireflies\"", "description": "Opens numerous gaps around Yukari that fire danmaku forward. Even when the enemy gets behind Yukari, the firing direction will follow the enemy."},
            "207": {"name": "Aerial Bait \"Laced With Venom\"", "description": "Opens up multiple sites at the top of the screen through which high-speed flying objects pass and attack. Its effect is very wide-range, so it will be hard for the opponent to move once it's started."},
            "208": {"name": "Magic Eye \"The Magic Eye of Laplace\"", "description": "A large number of eyes appear, staring at the enemy. Once the eyes see an exploitable weakness, they attack. It seems this is how Yukari knows what's going on in all of Gensokyo at all times."},
            "215": {"name": "Obsolete Line \"Trip to the Old Station\"", "description": "An assault that sends an abandoned train from the gap. The train can't be grazed or guarded and the damage is high. The downside is that opening the gap takes a long time."}
        },

        "yuyuko": {
            "100": {"name": "Ghostly Butterfly", "description": "Releases ghost-shape bullets from her hands that turn into homing butterflies when they reach the edge of the screen."},
            "101": {"name": "Light of the Undead", "description": "A five-branched laser. Since it radiates outward, it covers more area the farther it goes."},
            "102": {"name": "Eternal Wandering", "description": "Calls forth a number of spirits in a ring that floats upwards. As you might imagine, it's effective against airborne opponents."},
            "103": {"name": "Dance of the Butterfly Dream", "description": "Steps forward and attacks with fans in both hands. An effective grazing rush attack markedly different from her usual slow movement. With C, it travels farther."},
            "104": {"name": "Spirits that Died Well", "description": "A variation of Ghostly Butterfly. A ghost sent to the edge of the screen turns into a laser attack."},
            "105": {"name": "Lance of the Swallowtail Crest", "description": "A piercing attack using a sword-shaped fey mist. The excess power turns into butterflies on release that scatter over a wide area. Is this accidental or on purpose? Most suspicious."},
            "106": {"name": "Spirit-Luring Nectar", "description": "Simultaneously releases a spirit-attracting orb and spirits. You can control the orb's direction, making the spirits follow. Holding extends the controllable time."},
            "107": {"name": "Reverse Screens", "description": "Flips backwards, clearing out the area before her. It has invincibility and is strong, but is very close-range and will usually miss if the enemy isn't attacking. Very counter-centric."},
            "108": {"name": "Sphere Bloom", "description": "Light particles disperse like whips and become sakura petals that attack the enemy after a time delay."},
            "109": {"name": "Land of Death", "description": "Ghosts fly out and advances towards the enemy repeatedly in this ranged attack. An attack that fully showcases the whimsical nature of ghosts."},
            "110": {"name": "Gifts to the Deceased", "description": "Yuyuko flies skywards, grabbing the enemy and throwing her. Since she depends on ghosts for this move, whenever she performs it she becomes extremely hungry."},
            "111": {"name": "Sense of Elegance", "description": "Yuyuko spins in place, using her sharp fans to hit the enemy. A graceful, beautiful and deadly dance."},
            "200": {"name": "Death Sign \"Ghastly Dream\"", "description": "Fires a wave of butterfly shots out in a circle. It's unrivaled in terms of covering your surroundings, so it's an easy card to switch in."},
            "201": {"name": "Nether Sign \"Passage to the Underworld\"", "description": "Forms an easy path to the land of the dead at her hands. From there, many ghosts pour out, but since they're ghosts, they just go wherever they want."},
            "202": {"name": "Ghost Sign \"Ageless Dream\"", "description": "Drain the enemy's strength with a ghost. Be aware that the possession ends and total damage is lowered when Yuyuko is interrupted by attacks."},
            "203": {"name": "Deadly Butterfly \"Endless Nap\"", "description": "Create a storm of butterfly shots. The butterflies spiral around Yuyuko and spread out across the screen."},
            "204": {"name": "Lost Again \"Gensokyo's Hell\"", "description": "The great task of opening the gate to the next world. From the gate, ghosts pour out, attacking the enemy. The enemy's movement is greatly restricted."},
            "205": {"name": "Life Limit \"Ticket to the Netherworld\"", "description": "Fire ghosts that possess the enemy. They are harmless, but when the last ghost vanishes, it strikes hard. Be aware that if Yuyuko is damaged before the countdown finishes, possession stops."},
            "206": {"name": "Psyche \"As the Butterfly Flies\"", "description": "Ghostly Butterfly, wide version. They form a wall, attacking in all directions at once. The ghosts do no damage, but it's a good moment to attack."},
            "207": {"name": "Butterfly Sign \"Death Lance\"", "description": "A fan opens from behind and fires beams and butterflies forwards at random."},
            "208": {"name": "Elegance \"Invitation to the Afterlife\"", "description": "Ghosts surround the enemy, slowly moving inwards. A direct hit is difficult, but the enemy's freedom is severely restricted."},
            "209": {"name": "Cherry Sign \"Sense of Cherry Blossom\"", "description": "Unleashes a spiral of energy skywards. Takes a long time to prepare, but has unparalleled range and power."},
            "219": {"name": "\"Resurrection Butterflies\"", "description": "Beams of light eminate from Yuyuko, and swarms of butterfly attack. It starts out weak, but becomes stronger and stronger as it is used more often."}
        },

        "music": {
            "op": {"name": "Sky of Scarlet Perception"},
            "op2": {"name": "Did You See That Shadow?"},
            "select": {"name": "Memory of Foregathering Dream"},
            "sr": {"name": "Oriental Sky of Scarlet Perception"},
            "sr2": {"name": "The Eternal Steam Engine"},
            "st00": {"name": "The Ground is Yellow"},
            "st01": {"name": "Fragrant Plants"},
            "st02": {"name": "Dancing Water Spray"},
            "st03": {"name": "Ridiculous Game"},
            "st04": {"name": "Crimson in the Black Sea ~ Legendary Fish"},
            "st05": {"name": "Catastrophe in Bhava-Agra ~ Wonderful Heaven"},
            "st06": {"name": "Child's View of Bhava-Agra"},
            "st10": {"name": "Mystic Oriental Love Consultation"},
            "st11": {"name": "Vessel of Stars ~ Casket of Star"},
            "st12": {"name": "Flowering Night"},
            "st13": {"name": "The Doll Maker of Bucuresti"},
            "st14": {"name": "Hiroari Shoots a Strange Bird ~ Till When?"},
            "st15": {"name": "Locked Girl ~ Girl's Secret Room"},
            "st16": {"name": "Bloom Nobly, Cherry Blossoms of Sumizome ~ Border of Life"},
            "st17": {"name": "Septette for the Dead Princess"},
            "st18": {"name": "Night Falls"},
            "st19": {"name": "Broken Moon"},
            "st20": {"name": "Lunatic Eye ~ Invisible Full Moon"},
            "st21": {"name": "Wind God Girl"},
            "st22": {"name": "Higan Retour ~ Riverside View"},
            "st30": {"name": "Faith is for the Transient People"},
            "st31": {"name": "Beloved Tomboyish Girl"},
            "st32": {"name": "Shanghai Teahouse ~ Chinese Tea"},
            "st33": {"name": "Solar Sect of Mystic Wisdom ~ Nuclear Fusion"},
            "st34": {"name": "Tomorrow Will Be Special, Yesterday Was Not"},
            "st35": {"name": "Unknown X ~ Unfound Adventure"},
            "st36": {"name": "X, the Floating Objects in the Sky"},
            "st40": {"name": "Dichromatic Lotus Butterfly ~ Ancients"},
            "st41": {"name": "Love-Colored Magic"},
            "st42": {"name": "the Grimoire of Alice"},
            "st43": {"name": "Voile, the Magic Library"},
            "ta00": {"name": "Usual Days"},
            "ta01": {"name": "Argue For and Against"},
            "ta02": {"name": "Skies Beyond the Clouds"},
            "ta03": {"name": "Beautiful Nature Sight"},
            "ta04": {"name": "Drunk as I Like"},
            "ta05": {"name": "Swing a Fish to Drive Away Flies"},
            "ta06": {"name": "Darkening Dusk"},
            "ta07": {"name": "Flawless Clothing of the Celestials"},
            "ta08": {"name": "Free and Easy"},
            "ta20": {"name": "The Legendary Titan"},
            "ta21": {"name": "Our Hisou Tensoku"},
            "ta22": {"name": "The Scenery of Living Dolls"}
        }
    },

    "scenario": {
        "chirno": {
            "000": {
                "0": "That thing just now...",
                "1": "It had to be that<br>legendary giant youkai Daidarabocchi!",
                "2": "If I can tame it,<br>I'm not gonna be scared of anything ever again!",
                "3": "It seems that it was somewhere around here<br>when it disappeared.",
                "4": "Oh? As soon as the big thing disappears,<br>this small thing appears.",
                "5": "Hey, over there, Miss Fairy.<br>Have you seen a giant ro...",
                "6": "I mean... I wonder if you've seen<br>a huge moving human shape around here?",
                "7": "I haven't seen anything like a Daidarabocchi!",
                "8": "Daidarabocchi?<br>I wonder, did I really say anything like that...?",
                "9": "Ah, no, never mind.<br>I haven't seen anything at all!",
                "10": "I wonder if you could be plotting something?<br>Playing the Brocken spectre in this deep fog?",

                "11": "Hmm.<br>I'm feeling great today!",
                "12": "Now then, how about I go<br>search for the Dardarabocchi?",
                "13": "Owww. I guess I shouldn't have taken<br>her too lightly just because she was a fairy."
            },

            "001": {
                "0": "If that was the Taisui Xingjun,<br>then this could be bad.",
                "1": "Pretty soon we'll be<br>visited by a catastrophe!",
                "2": "What are you grumbling to yourself about?",
                "3": "Wh-what is it?<br>Oh, it's just a fairy.",
                "4": "Yep, a fairy.<br>But I'm just passing by so...",
                "5": "Okay. I have a very important task<br>that I must take care of.",
                "6": "So, just finish passing by and go away.",
                "7": "Weren't you getting all hot and bothered<br>over something just now?<br>I'm kind of interested.",
                "8": "!? It's nothing for a fairy to worry about!",
                "9": "This may be more interesting than<br>the Daidarabocchi!",
                "10": "I have no choice then... looks like<br>I'll have to chase the pest away first.",

                "11": "Ermmmmm, what was I going to do?",
                "12": "Eh?",
                "13": "Err, umm.<br>Hey, lady, do you know what I was going to do?",
                "14": "Eh? Ah, I know!<br>You said Daidarabocchi or something!",
                "15": "Oh yeah! Searching for the Daidarabocchi!<br>Gotta go!",
                "16": "...."
            },

            "002": {
                "0": "The hot spring here<br>sure does wonders for the body.",
                "1": "Now if there were only some well-chilled sake<br>around then that'd be the best...",
                "2": "Was it over here?",
                "3": "Oh, a well-chilled fairy.<br>Seeing one in a place like this is rare.",
                "4": "Have you seen a Daidarabocchi around here?",
                "5": "A Daidarabocchi?",
                "6": "A gigantically huge youkai!<br>I saw it around here somewhere just now!",
                "7": "Ho ho! A big youkai, is it?<br>Hm, I can't say I don't know.",
                "8": "Eh? Really?<br>Where, where?",
                "9": "Not telling.<br>I have no obligation to tell a fairy.",
                "10": "So then it'll be OK if I hurt you<br>and force you spit it all out?",

                "11": "C'mon! Where is it!", 
                "12": "Owww.<br>I'll talk already, so just hold up a sec.",
                "13": "That thing...<br>went into this here Geyser Underground Center.",
                "14": "Really!?<br>Then I'll find it real soon right?",
                "15": "I'll be the first one there!",
                "16": "Well then, that was a total lie.",
                "17": "It's gonna be too hot for her in there.<br>Serves her right.",
                "18": "But what was that about a Daidarabocchi...?<br>Hey, what's that? In the forest..."
            },

            "003": {
                "0": "So hot! This is unbearable!",
                "1": "Foreign substance detected!",
                "2": "Significant drop in reactor core temperature<br>requires urgent attention. The foreign substance<br>is to be immediately eradicated!",
                "3": "Wawawawawa!",

                "4": "This is hot!<br>I've got to get the heck out of here!",
                "5": "Do you think I'll let you escape<br>before I eradicate you?!",
                "6": "I'll escape before I get eradicated!",
                "7": "Will you really manage to escape from me?<br>Or will I simply force you to buzz off?",
                "8": "It's a fight!",

                "9": "Now's my chance!<br>I'm outta here!",
                "10": "Now then, you can't possibly escape<br>from my next attack!",
                "11": "Eh, what?<br>Could it be...",
                "12": "I raised the firepower so much that<br>she got vaporized without a trace?",
                "13": "I overdid it a bit. Well, whatever.<br>Let's get back to work."
            },

            "004": {
                "0": "Oh, you certainly came back quickly.",
                "1": "It was unbelievable! That place!",
                "2": "I guess so.<br>That is the hot spring's boiler after all.",
                "3": "If the Daidarabocchi is in that kinda place<br>then I can't do anything but give up...",
                "4": "Come on, wait a second.<br>Don't get so depressed like that!",
                "5": "?",
                "6": "I saw a big youkai in the forest's direction<br>just now. It seems like<br>it went over there unnoticed.",
                "7": "Really!?",
                "8": "Yeah, this time I'm not lying.<br>It's over there. Look! See it?",
                "9": "Oh wow!<br>Something big's there!",
                "10": "That thing... I wonder what it could be.<br>Somehow, I can sort of imagine.",

                "11": "Further research is still necessary.",
                "12": "It's here somewhere.",
                "13": "Whoa!",
                "14": "Oh, an unusual face.<br>A lost child?",
                "15": "N-no, I'm not lost.<br>Anyways, around here...",
                "16": "Around here?",
                "17": "Didn't you see a Daidarabocchi?",
                "18": "A Daidarabocchi?",
                "19": "A gigantically huge youkai!<br>It was here just now!",
                "20": "A big youkai...<br>Ah, I see.",
                "21": "You've seen it?<br>You know where it is?",
                "22": "I do know. Probably.<br>You want to see it too?",
                "23": "I wanna, I wanna!<br>I've been looking for it all day!",
                "24": "It's still in an experimental phase but...<br>but this might be just<br>the right time for a test run.",
                "25": "Hurry! Hurry! Daidarabocchi!",
                "26": "To replenish the magic, a little energy<br>is necessary. You have a lively personality.<br>Let's take a bit of that!"
            },

            "ed": {
                "0": "---Hakurei Shrine, the eastern border of Gensokyo.",
                "1": "There was something there more annoying<br>than the incessant chatter of cicadas.",
                "2": "This annoyance, however, is integral to this story.",

                "3": "Reimu  \"So? What about Daidarabocchi?\"",
                "4": "Cirno  \"Daidarabocchi's this giant youkai!\"",
                "5": "Reimu  \"I... I see...\"",
                "6": "Cirno  \"Um, it looks like a giant doll...\"",
                "7": "Marisa \"Huh...\"",
                "8": "Cirno  \"Anyways, it's huge and it can move around on its own!",
                "9": "    If that thing goes out of control, Gensokyo's in danger!\"",
                "10": "Reimu  \"A large doll... are you talking about this, perhaps?\"",

                "11": "Reimu  \"Hisou Tensoku, a giant automated youkai-type doll.\"",
                "12": "Cirno  \"Hisou Tensoku?\"",
                "13": "Reimu  \"It's a large doll designed by the Kappa.\"",
                "14": "Cirno  \"Kappa?\"",
                "15": "Reimu  \"Everyone's seen this.",
                "16": "    If you go to the foothills right now, you can see it.\"",
                "17": "Cirno  \"What? Everyone's seen this? Boring.\"",

                "18": "Cirno  \"Hisou Tensoku...",
                "19": "    Huh?\"",
                "20": "Reimu  \"Its movements are really realistic.",
                "21": "    I heard it's operated by steam power.\"",
                "22": "Cirno  \"What... is this?\"",
                "23": "Reimu  \"You mistook this for Daidarabocchi, didn't you?\"",
                "24": "Cirno  \"Huh? Is that what happened?\"",
                "25": "Reimu  \"Well in any case, it's just a giant doll.",
                "26": "    No need to be afraid.\"",
                "27": "Cirno  \"Huh? No, this isn't what I saw!",
                "28": "    This is totally different!\"",
                "29": "Reimu  \"Eh?\"",
                "30": "Cirno  \"It was more realistic, and it looked more threatening!",
                "31": "    Anyways, this is wrong! Totally different!\"",
                "32": "Reimu  \"I see...",
                "33": "    Walk me through your story.\"",

                "34": "Cirno tried her best to be as specific<br>as she could while reconting her tale.",
                "35": "She had gone down to the underground center<br>of the geysers to follow Daidarabochi.",
                "36": "She had been driven away by the heat.<br>And then, she saw a giant youkai in the forest.",
                "37": "But she forgot to tell<br>the most important part of her story.",
                "38": "People couldn't remember<br>what the youkai looked like.",
                "39": "In other words,<br>she didn't tell Reimu who she had met.",
                "40": "Her story quickly became<br>an urban legend.",
                "41": "Because the most important<br>of the story was missing.",
                "42": "It changed over time,<br>and evolved into a wonderful ghost story.",
                "43": "\"A Midsummer Day's Giant Youkai\",<br>the story was called.",

                "44": "When Alice heard the story, she had no idea...",
                "45": "... that they were talking about<br>her own \"Doll Enlargement Project\"",
                "46": "She was dead-set.",
                "47": "She needed to quickly gain<br>the ability to magically enlage objects...",
                "48": "...in order to fight this giant unknown terror."
            }
        },

        "meirin": {
            "000": {
                "0": "Lady Patchouli!",
                "1": "What? So loud...",
                "2": "It's terrible!<br>Just now, I saw something that should not be seen!",
                "3": "Something that should not be seen?",
                "4": "It was the Taisui Xingjun.<br>We must assume the worst possible scenario!",
                "5": "... so?",
                "6": "Like, an earthquake or something like that!",
                "7": "...<br>Earthquakes are getting old now.",
                "8": "Huh?",
                "9": "#Whatever you're doing,<br>it's interrupting my research.<br>Get back to your guard post!",

                "10": "It's true!",
                "11": "I don't care if it's true.<br>It's just an earthquake, right?",
                "12": "How can you say \"just\"?<br>We mustn't make light of earthquakes!"
            },

            "001": {
                "0": "Now that it's come to this,<br>I have no choice but to ambush it!",
                "1": "The Taisui Xingjun will surely send<br>all kinds of disaster-causing youkai!",
                "2": "I'd like to go to the library,<br>could you lead me there?",
                "3": "Whoa!<br>It appeared already!",
                "4": "What are you talking about?<br>I just want to go to the library.",
                "5": "Heh heh heh.<br>I'm completely aware of what's going on!<br>You are...",
                "6": "You are a youkai sent by the Taisui Xingjun!",
                "7": "Ahaha! As expected of the<br>Scarlet Devil Mansion's gatekeeper!",
                "8": "This temporary appearance, you saw through it immediately!",

                "9": "That was dangerous.<br>Getting attacked by familiar forms is terrifying!",
                "10": "....",
                "11": "Of course you'd stay silent. It looks like you can't even move anymore.",
                "12": "But, I don't think it'll end with this.<br>I have to keep up the attack!"
            },

            "002": {
                "0": "Now then, today I'll be<br>going to the library again!<br>I'm a young lady of literature.",
                "1": "....",
                "2": "Oh?! For some reason I'm not being stopped.<br>I'm seriously going in? I'm really going in, okay?",
                "3": "You, too, are a fake!<br>I can see through everything!",
                "4": "A fake?",
                "5": "For you, who always comes through<br>the main gate proudly and boldly,<br>Coming in from the sky is ridiculous!",
                "6": "Heh heh. Very impressive.<br>As expected of the Great Wall<br>of the Scarlet Devil Mansion, Meiling.",
                "7": "Just about anyone could<br>see through that disguise!",
                "8": "However, simply seeing through to my true form<br>won't be enough to win against me!",

                "9": "Hmph. Your power wasn't that different<br>from the original human.",
                "10": "....",
                "11": "What a fiendishly evil youkai,<br>the Taisui Xingjun.",
                "12": "If it wasn't for me,<br>the Scarlet Devil Mansion would've surely<br>been taken over right about now..."
            },

            "003": {
                "0": "Well then, today's another good day for<br>exterminating some youkai. I'll disinfect all<br>the devils at the Scarlet Devil Mansion!",
                "1": "Hmph. So you came!<br>You monster of disasters.",
                "2": "Did you say monster?",
                "3": "No matter how skillfully you disguise yourself<br>as a human, it's futile!<br>My eyes won't be deceived.",
                "4": "Hoho. When I've taken this form<br>of a shrine maiden, you would<br>call me a monster?",
                "5": "Isn't that an amusing thing to say.<br>Even though you're the monster.",
                "6": "Hmph. Certainly I am a youkai.<br>However...",
                "7": "However?",
                "8": "I am a youkai who loves Gensokyo<br>with all her heart! I have nothing to do<br>with creatures of destruction like you!",
                "9": "Splendid! Simply splendid!<br>You're an example youkai.",
                "10": "However, do you think that pretty words alone<br>can protect peace and harmony?",
                "11": "We shall bring disaster<br>into Gensokyo!",
                "12": "A calamity that will<br>make the Earth itself tremble!",

                "13": "I didn't even approach the limits<br>of my true powers, but I guess<br>such powers aren't even necessary!",
                "14": "Mmph.<br>As expected from you, eh?",
                "15": "But it appears as if you've spent all your energy<br>in a wanton series of battles.",
                "16": "Tch!",
                "17": "Now then, the time has come hasn't it,<br>to show you my true form!",
                "18": "Finally, it seems to be<br>revealing its true form...!"
            },

            "004": {
                "0": "Where are you?!<br>Where could you be I said?!",
                "1": "You who tramples Gensokyo,<br>Taisui Xingjun's servant.<br>It'd be good if you showed up!",
                "2": "Ahahaha.<br>Finally, I've been revived.",
                "3": "The battles with the assassins<br>I sent to handle you,<br>you enjoyed them, didn't you?",
                "4": "?",
                "5": "I only sent those fools<br>to drain your energy!",
                "6": "!?",
                "7": "That's right, the energy needed for my revival.<br>For the sake of these powers that will<br>cause the Earth itself to tremble!",
                "8": "What did you say?!",
                "9": "Without you noticing,<br>they all worked hard for my sake.",
                "10": "How does it feel?<br>Are you so furious you can't even think?",
                "11": "Or perhaps,<br>Have you been struck speechless with grief?",
                "12": "Heh heh heh.",
                "13": "Why are you laughing?",
                "14": "To think that you would go that far<br>for the sake of preparing for me.",
                "15": "What did you say?!",
                "16": "For the sake of creating my legend!",
                "17": "Eh?",
                "18": "The one that this world couldn't do without.<br>For the sake of the tale of the<br>sole gatekeeper and protector of Gensokyo!",
                "19": "It's strange that you're underestimating me.",
                "20": "I am one who manifests the presence of the<br>most unholy and cataclysmic<br>of all youkai, Taisui Xingjun.",
                "21": "I am the legendary Supreme Catfish.<br>I need but move and the earth itself will tremble,<br>the lands on the surface will disintegrate.",
                "22": "The likes of you cannot even<br>begin to comprehend my power!"
            },

            "ed" : {
                "0": "---The underground library of the Scarlet Devil Mansion.",
                "1": "The place was cool in the summer and warm in the winters,<br>so it was always comfortable.",
                "2": "In addition, since there was no light,<br>it was the prime location for preserving books.",

                "3": "Meiling \"...I won't let earthquakes happen.",
                "4": "    I will protect Gensokyo!\"",
                "5": "Patchy \"So? How long is this idiot going to snooze?\"",
                "6": "Sakuya \"She was asleep outside when I found her.",
                "7": "    I thought we were being attacked.\"",
                "8": "Patchy \"Huh. If you leave her outside like that,",
                "9": "    she's going to get heatstroke.\"",
                "10": "Sakuya \"So should I bring her some cold wet towels?\"",
                "11": "Patchy \"She doesn't need that. She's a youkai, after all.\"",

                "12": "Meiling \"...what?",
                "13": "    You're the last boss? Taisui Xingjun?!\"",
                "14": "Sakuya  \"...what the hell is that?\"",
                "15": "Patchy  \"Taisui Xingjun? Hmm...",
                "16": "    I think I've heard that from someone else, too.\"",
                "17": "Meiling \"Alright, I accept your challenge!",
                "18": "    There's no one left to fight me anyways!\"",
                "19": "Patchy  \"Oh, that's right, I heard that name from her.",
                "20": "    She told me she saw Taisui Xingjun outside or something.\"",
                "21": "Sakuya  \"Maybe she got attacked by him...",
                "22": "    which is why she won't wake up?\"",

                "23": "Patchy \"Huh. Who knows.",
                "24": "    I think she's just tired because she exerted herself too much.",
                "25": "    Besides, she dropped this while she was working.\"",
                "26": "Sakuya \"Ah, is this the Tengu's action manga?\"",
                "27": "Patchy \"It's some dumb story about how evil youkai",
                "28": "    possessed the friends and families of everyone in Gensokyo",
                "29": "    and started attacking.\"",
                "30": "Meiling \"Shit! You're too strong!\"",
                "31": "Patchy \"I'm sure she read this and she's having a blast",
                "32": "    fighting all the youkai in her dreams.\"",
                "33": "Sakuya \"Hmm. Lucky her, she can still dream.",
                "34": "    Oh, speaking of tengu...",
                "35": "    did you read about the Kappa's Bazaar in the paper?\"",
                "36": "Patchy \"Oh yeah, I saw that.",
                "37": "    Giant doll named Hisou Tensoku or something.\"",
                "38": "Sakuya \"I believe the Lady wants to go see this doll.",
                "39": "    What about you, Lady Patchouli?\"",
                "40": "Patchy \"Naturally I plan to go as well.",
                "41": "    I must go before important items",
                "42": "    fall into other people's hands...\"",
                "43": "Sakuya \"Well then, we'll need a gatekeeper...\"",

                "44": "Meiling was beaten awake,<br>and remembered something extremely embarrassing.",
                "45": "She was watching the gate as always,<br>and began reading an action manga to kill time.",
                "46": "Ultimately, she wake up before<br>she defeated Taisui Xingjun.",
                "47": "But there was something that made her uneasy.",
                "48": "She saw something like Taisui Xingjun<br>that was not a dream.",

                "49": "The most malicious, most brutal youkai,<br>undefeatable even in one's own dreams.",
                "50": "Meiling who was forced to retreat from her battle,<br>could not remember what it looked like.",
                "51": "Perhaps someday, a youkai as fearsome<br>will appear in Gensokyo.",
                "52": "Perhaps, when it does appear, all of Gensokyo's<br>youkai will band together to fight it.",
                "53": "\"For everyone's sake, i will fight on the frontline\"<br>Meiling confirmed to herself."
            }
        },

        "sanae": {
            "000": {
                "0": "That thing just now...",
                "1": "It had to be that<br>legendary giant youkai, Daidarabocchi!",
                "2": "If I can tame it, I'm not gonna be<br>scared of anything ever again!",
                "3": "It seems that it was somewhere around here<br>before it disappeared.",
                "4": "Oh? As soon as the big thing disappears,<br>this small thing appears.",
                "5": "Hey, over there, Miss Fairy.<br>Have you seen a giant ro...",
                "6": "I mean... I wonder if you've seen<br>a huge moving human shape around here?",
                "7": "I haven't seen a Daidarabocchi!",
                "8": "Daidarabocchi?<br>I wonder, did I really say anything like that...?",
                "9": "Ah, no, never mind.<br>I haven't seen anything at all!",
                "10": "I wonder if you could be plotting something?<br>Playing the Brocken spectre in this deep fog?",

                "11": "Brocken spectre?<br>What's that?",
                "12": "An illusion that looks like<br>a giant stretched-out moving youkai.",
                "13": "Speaking of which, you saw<br>a huge human shape, right?",
                "14": "I saw it, I saw it.<br>I saw it over there."
            },

            "001": {
                "0": "That giant just now... I wonder what it was.",
                "1": "Just when I thought it had lurched its way<br>to the mountains, it and the<br>lukewarm mist both disappear.",
                "2": "I'm sure that must have been an evil omen.<br>The shadow of Taisui Xingjun!",
                "3": "Excuse me.",
                "4": "Wh-What is it?<br>We never accept guests here...",
                "5": "I was wondering if you'd perhaps seen<br>a huge human-like figure around here?",
                "6": "If you're talking about a huge human-like figure,<br>then I saw one head towards the mountain...",
                "7": "Towards the mountain...?<br>I just came from the mountain.<br>I wonder if I passed it at some point...",
                "8": "So, who do you think you are,<br>just coming in as you please?",
                "9": "Eh? Is this a place where<br>I can't come in as I please?",
                "10": "Of course you can't.<br>These are the estate grounds of a demon.<br>I won't let an exorcist pass!",

                "11": "I really don't have any interest in this mansion.<br>In any case, that giant robo...<br>figure can't exactly hide.",
                "12": "Eh? A giant robot?",
                "13": "What's this lukewarm mist?",
                "14": "The base of the mountain!<br>It appeared! The giant human-like figure!"
            },

            "002": {
                "0": "The reappearing human-like giant seems to be<br>rampaging near the Geyser Underground Center<br>at the base of the mountain.",
                "1": "Just as she thought that, both it <br>and the mist disappear again.",
                "2": "Sanae thought that the grounds under the geyser<br>were strange, so she descended underground<br>to where the sun resides.",

                "3": "The Geyser Underground Center.",
                "4": "This was created for the Goddess Kanako's plans,<br>the site for the mountain's<br>technological breakthrough.",
                "5": "It's certainly possible with a place like this!<br>This must be the giant robot's docking bay!",
                "6": "In the outside world, giant robots<br>don't exist outside of anime,<br>but since this is Gensokyo, then maybe...!",
                "7": "In Gensokyo, where the fairies dance<br>and the tengu whirl about, surely...!",
                "8": "What's with this lousy pitfall trap!?",
                "9": "Huh?<br>What the heck is this place?",
                "10": "Oh Reimu.<br>What happened?",
                "11": "I thought I'd go to the hot spring,<br>when all of a sudden, the ground crumbled...",
                "12": "My goodness. I wonder if I forgot to<br>take care of the cover-hatch.",
                "13": "Where is this?",
                "14": "This is the Geyser Underground Center.<br>A facility used for researching nuclear fusion.",
                "15": "You're planning something<br>naughty again, aren't you?!",
                "16": "I would never think of doing anything naughty.",
                "17": "Talk is cheap!<br>Making such a huge pitfall trap is unforgivable!",

                "18": "I'm not the one responsible for<br>these circumstances, nor am I<br>the one in control of them.",
                "19": "Oww. Now I'm starting to feel<br>the pain from the fall.",
                "20": "This is where the kappa come<br>to research and build. I was...<br>interested in something, so I came here, but...",
                "21": "Oh, is that right?<br>Well, whatever.",
                "22": "If anything weird happens,<br>it'll just be your fault.",
                "23": "Now then.<br>I'll be arriving at the deepest level soon."
            },

            "003": {
                "0": "It's so hot...",
                "1": "Staying here too long could be dangerous<br>with such high temperatures.",
                "2": "Foreign substance sighted!",
                "3": "Upon contamination of the nuclear reactor core,<br>reactor operations are to be halted<br>and the foreign substance eradicated immediately!",
                "4": "!",

                "5": "Wait, wait!",
                "6": "I'm a shrine maiden of Lady Kanako!",
                "7": "Um.<br>Who's Lady Kanako?",
                "8": "Crows are really birdbrained after all.<br>Simply put, I serve a higher power than yourself.",
                "9": "A servant of a higher power?",
                "10": "A servant can't be that great, can it?<br>Then a human that's not great is...",
                "11": "Ah, which reminds me, I came because of<br>the notification that a foreign substance<br>had contaminated the reactor core!",
                "12": "No, I mean...",
                "13": "And... foreign substance detected!<br>Must eradicate that higher power's<br>lowly foreign substance!",
                "14": "Unless I can completely exhaust that<br>lively energy of yours, it looks like<br>we won't be able to talk any further.",

                "15": "That's as far as you go!",
                "16": "Wait, what were we doing again?",
                "17": "Er... You were listening to my orders and<br>helping me with my investigation of this reactor.",
                "18": "Ah, is that right??",
                "19": "Yes, that's right.<br>Please proceed as planned.",
                "20": "Then what should I be doing?",
                "21": "Investigate whether or not<br>a gigantic thing has been hiding here.",
                "22": "What's the gigantic thing?<br>About how gigantic?",
                "23": "It's humanoid...<br>and about 100 meters?",
                "24": "100 meters?",
                "25": "Hm. About the length of this<br>reactor's diameter from end to end?",
                "26": "A human that big?!<br>There's no way such a thing exists, right?",
                "27": "If there were something like that,<br>there's no way I wouldn't have noticed.",
                "28": "I suppose that's true.",
                "29": "But there's no doubt that it<br>disappeared from the surface."
            },

            "004": {
                "0": "This is certainly no place to seek refuge.",
                "1": "This reactor core is far simpler than<br>I thought it would be.<br>Except for the heat...",
                "2": "We're really far underground.<br>But even here, you can see the sky.",
                "3": "The sky appears so tiny from here that<br>you can barely sense its presence.",
                "4": "I wonder if it would have been better<br>if the vampires lived here.",
                "5": "In any case, the reactor core is blazing hot.<br>It seems the rising vapors originated here.",
                "6": "Aha! Perhaps that figure I saw earlier...!",
                "7": "Was it just the vapors rising from here<br>projecting someone's shape...?",
                "8": "No, it couldn't be anything like that.<br>It looked so much more real...",
                "9": "What?",
                "10": "That sounds like footsteps...<br>And this vibration...",
                "11": "So something that was merely fantasy<br>in the outside world has<br>made its way into Gensokyo...",
                "12": "Yes, this is surely that thing!",
                "13": "That thing that was never implemented<br>because of its impracticality!",
                "14": "The bipedal giant robot I've<br>longed to see is in Gensokyo!",
                "15": "Look out belooow!",
                "16": "Oops! It seems I landed on something.",
                "17": "Oh my, it's Sanae.<br>What are you doing here?",
                "18": "Oww...<br>What in the name of...",
                "19": "Oh! Lady Suwako?<br>What are you doing here?!",
                "20": "I had some small things to take care of.<br>Anyway, it's amazing that you're down here, Sanae.",
                "21": "Oh, yes! I've discovered something fantastic!",
                "22": "Ohhh? Tell me, tell me!",
                "23": "I came here in pursuit of a giant shadow, but...",
                "24": "There was actually a giant robot!<br>Right here in Gensokyo!",
                "25": "Giant robot?",
                "26": "Yes, well, I don't have definite proof yet,<br>but its existence is truly a wonder.",
                "27": "Well, that's surprising!<br>So, where did you see it?",
                "28": "Just above this place.<br>But it disappeared in a poof when I arrived.",
                "29": "Above this place?<br>Disappeared in a poof?",
                "30": "Speaking of which, what were those small things<br>you came to take care of, Lady Suwako?",
                "31": "Hisou Tensoku's being bad.<br>I came underground to restart it.",
                "32": "Hisou Tensoku...?<br>What might that be?",
                "33": "Hisou Tensoku is... wait, what?<br>Sanae, you say you saw a giant robot?",
                "34": "Huh? Is there some connection<br>to the giant robot or something?",
                "35": "Ahaha! Can it be that<br>the robot Sanae caught a glimpse of...",
                "36": "There's something you know, isn't there?!",
                "37": "Hm, maybe.<br>If it's a \"giant robot,\" then<br>it's probably Hisou Tensoku, right?",
                "38": "Oh, that cracks me up!<br>The phrase \"giant robot\" sure brings me back.",
                "39": "Well, what's wrong with calling it that?<br>And you say this giant robot<br>is named Hisou Tensoku?",
                "40": "I named it Tensoku 'cause by natural laws,<br>such a thing would be unimaginable.<br>Or in other words, it's a silly thing.",
                "41": "Huh?",
                "42": "Sanae, you were also silly for chasing after it.",
                "43": "What did you say?",
                "44": "Well, you're calling it a giant robot.<br>Hisou Tensoku is just...",
                "45": "Well, a dumb blockhead...",
                "46": "Does Lady Kanako know anything about what<br>you're calling Hisou Tensoku?",
                "47": "She doesn't, does she? Maaaybe?",
                "48": "The point is, hasn't there been<br>a lot of this lately? Doing all kinds of<br>weird things without telling anyone?",
                "49": "Oh, it's no big deal. It's not as if...",
                "50": "This isn't right! Doing this even though keeping<br>the nuclear fusion reactor a secret in the past<br>just made everyone angry!",
                "51": "Right, Hisou Tensoku is...",
                "52": "Today, you won't be getting away!<br>I may be only human, but nevertheless,<br>I'll have you regard my convictions!",
                "53": "But Sanaeee, you're not a human,<br>you're a living god, a miracle-worker...",
                "54": "All the better, then.<br>I can stand equally with you!",
                "55": "Lady Suwako, you've simply<br>gone too far with your selfish deeds!",
                "56": "Right here and now, I'll have you<br>endure a bit of pain.",
                "57": "Uhyaa!<br>Excellent, it's a battle, then!<br>This should be fun...",
                "58": "You won't hold back?",
                "59": "Since you dare to battle here in the underground<br>where I hold a natural advantage,<br>you've grown up a little too, haven't you, Sanae?",
                "60": "If you beat me here, maybe we won't have to<br>worry about always helping you with your<br>trouble-solving trips anymore!",
                "61": "Ah, but I travelled alone today.",
                "62": "I felt that Kanako was getting worried.<br>Thinking \"Would she know the way back home?\"<br>and such.",
                "63": "Well, then! Awe me, creator of these lands,<br>with your marvelous, god-like miracles!"
            },

            "ed": {
                "0": "---Hakurei Shrine, the border of Gensokyo.",
                "1": "The heat of summer heightened the contrast<br>between the blacks and greens of the shrine.",
                "2": "Were the cicadas to stop chirping,<br>one would perhaps stop thinking and lose sight of reality.",
                "3": "To be, and not think--- a simple task for an object,<br>but a difficult one for humans.",

                "4": "Marisa \"Hey, seen this news article?\"",
                "5": "Reimu  \"Looking at that now.",
                "6": "    The 47th day of the Sankuu Shogi Contest, right?\"",
                "7": "Marisa \"Ah, guess you can't help but look at a game like that",
                "8": "    with no winners or losers. Went into the thousands one time",
                "9": "    and no one ever noticed. Kept on repeating over and over.",
                "10": "    No, I'm not talking about that. Look at this!\"",
                "11": "Reimu  \"Futuristic Water Youkai Bazaar...",
                "12": "    massive sale of all sorts of rare items,",
                "13": "    from inventions by the Kappa to Shirikodama...\"",
                "14": "Marisa \"Looks interesting. Wanna go?",
                "15": "    We might find something nice.\"",
                "16": "Reimu  \"I dunno... the Kappa's inventions are kinda shady.\"",
                "17": "Marisa \"No way.\"",
                "18": "Reimu  \"Besides, who is she trying to appeal to,",
                "19": "    starting a shop out of the blue?\"",
                "20": "Marisa \"Isn't it because she doesn't have enough money",
                "21": "    to maintain her fusion reactor?\"",
                "22": "Reimu  \"That'd be reasonable. Oh, it talks about giant dolls here.\"",

                "23": "Marisa \"Lemme see.",
                "24": "    'Giant Youkai Automated Doll Hisou Tensoku Unveiled to Public.'",
                "25": "    'You can see it from far away, so come and take a look.'\"",
                "26": "Reimu  \"It's not being sold?\"",
                "27": "Marisa \"I don't know, are they trying to?",
                "28": "    I feel like it's just something to see,",
                "29": "    judging from what this article says.\"",
                "30": "Reimu  \"I saw it when it was still being tested.",
                "31": "    It moves pretty realistically.",
                "32": "    I wonder how they control it?\"",
                "33": "Marisa \"I dunno. It's too big for strings...\"",
                "34": "Reimu  \"How nice...\"",

                "35": "---A newcomer to the Mountain, Moriya Shrine.",
                "36": "The alpine summer was cool, mocking the sweltering heat of the foothills.",
                "37": "Here lived two gods... no, three.",

                "38": "Suwako \"Hisou Tensoku's just an ad for the Kappa.",
                "39": "    It moves pretty realistically though, doesn't it?\"",
                "40": "Sanae  \"It's uselessly realistic. I wanted a huge robot.\"",
                "41": "Kanako \"Huh. She made something like that?",
                "42": "    If I had designed it, it would have been more practical.\"",
                "43": "Suwako \"Forget practicality. I think it moves more realistically",
                "44": "    if it doesn't think about anything.",
                "45": "    The Kappa's design is wonderful.",
                "46": "    The doll is completely empty on the inside.\"",
                "47": "Sanae  \"Doesn't think? What do you mean...?\"",
                "48": "Kanako \"I see. We'd have problems if it suddenly developed cognition.\"",
                "49": "Suwako \"Precisely. We can't have something that large becoming sentient.",
                "50": "    If this doll acts in a meaningful manner and",
                "51": "    repeats those actions, it will eventually develop sentience.",
                "52": "    That's why she needed to create a doll that can't think.\"",
                "53": "Sanae  \"I see. But how does she recreate those realistic movements, then?\"",

                "54": "Suwako \"Nuclear power, naturally.\"",
                "55": "Sanae  \"Can nuclear power do everything?",
                "56": "    I have no idea what it is.\"",
                "57": "Kanako \"It's just light, infinitely expanded.",
                "58": "    They need to convert it into something else",
                "59": "    for that huge doll to move.",
                "60": "    You know, like heat or light...\"",
                "61": "Suwako \"Ah, that.",
                "62": "    She's just using the water vapor from the underground geysers.",
                "63": "    Increase the vapor, and the doll's arm raises, and vice versa.\"",
                "64": "Sanae  \"So that's just...\"",
                "65": "Kanako \"Like a giant balloon, right?\"",
                "66": "Suwako \"Hisou Tensoku really is remarkably empty, isn't it?\"",
                "67": "Sanae  \"I really wanted to have a giant robot battle or something.\"",
                "68": "Suwako \"You don't want to battle, you just want to ride it, don't you?\"",
                "69": "Sanae  \"What... what's wrong with that?",
                "70": "    It's always been humanity's dream to make a giant robot.\"",
                "71": "Kanako \"A doll that gathers humans together.",
                "72": "    I'm sure the youkai of Gensokyo are interested in this too.",
                "73": "    That Kappa has got some sharp marketing skills.\"",
                "74": "Suwako \"That's because I advised her.\"",

                "75": "The futuristic Water Youkai Bazaar<br>was a smashing success that summer.",
                "76": "The many inventions of the Kappa,<br>the brightly twinkling Shiridama...",
                "77": "...many people went and bought them.",
                "78": "But Hisoutensoku was<br>the real show-stopper",
                "79": "Many humans and youkai camme to see this<br>realistic moving giant doll.",
                "80": "Reimu and Marisa also came<br>to see the doll, and were satisfied.",

                "81": "It's very difficult for humans to stop thinking.<br>This is why enlightenment is a state devoid of thought.",
                "82": "But a doll can move without thinking<br>about anything in the first place.",
                "83": "Are dolls enlightened?<br>Has the state of thoughtlessness escaped humans?",
                "84": "Everyone who gazed upon Hisoutensoku<br>knew the answer.",
                "85": "Even the ancient youkai<br>lerned something from it."
            }
        }
    },

    "win": {
        "alice": {
            "reimuU0": "Why don't you just get some allies<br>that you can easily control?",
            "marisaU0": "Soon, the ultimate doll should be complete.<br>With this, the forest will be mine.",
            "sakuyaU0": "My underlings are more disciplined than yours.",
            "sakuyaR0": {
                "0": "What do you think?<br>My knife-wielding dolls are superb at cooking.",
                "1": "I hardly have to do a thing.",
                "2": "They're different from your useless maids."
            },
            "youmuU0": "The strings that attach the body and soul<br>are the same as the ones that control dolls.<br>Both are strings of the heart that cannot be cut.",
            "alice0": "It seems that it's more convenient to control<br>the dolls myself than to have dolls<br>that think on their own.",
            "patchouliU0": "Moving seems like it'd be such a hassle.<br>Way too many books.",
            "remiliaU0": "You want me to make you something?<br>A tough, square doll?",
            "yuyukoU0": "What's that ghost doing standing under the willow?<br>A street vendor or something?",
            "yukariU0": "Every time a service is held for a doll,<br>it gets dropped into Gensokyo, I see.",
            "suikaU0": "Pretty soon, I'll cut you down to size.<br>You have no exclusive patent on enlargement!",
            "ayaU0": "What's that about a puppet that extends its nose?<br>I hear it has nothing to do with tengu.",
            "udongeU0": "I've seen a rabbit doll with a cross as its mouth.<br>Does that cross mean to tell the rabbit to shut up?",
            "komachiU0": "Is there such thing as a human substitute doll?<br>Is a human soul that light a matter?",
            "ikuU0": "Worrying about earthquakes, huh.<br>Well, if you live in Gensokyo<br>you should be mentally prepared for it anyway.",
            "tenshiU0": "They say the hina dolls' festival is in the<br>peach season, but by today's calendar, the<br>peach blossoms aren't out yet...",
            "sanaeU0": "You're very different from Reimu.<br>Yes, shrine maidens and gods are meant to be a pair.",
            "chirnoU0": "Even if you were stuffed inside a doll,<br>I don't think anyone would notice...",
            "meirinU0": "Aren't there about ten thousand soldier dolls<br>buried under your country? Amazing.",
            "utsuhoU0": "I don't really associate crows with the sun.",
            "suwakoU0": "Stuffed frogs are very popular with<br>the humans of the village.<br>But tadpoles are quite nice.",
            "common0": "Everyone's so starved for battle, thinking<br>of nothing but researching new fighting techniques.",
            "common1": "Nothing is better than strength in numbers.<br>Big things are a combination of small things!"
        },

        "aya": {
            "reimuU0": "Hm, perhaps this shrine's blessing<br>is the discovery of new news material?",
            "reimuU1": "As always I'm able to find news at the shrine.<br>I must pay my respects to it somehow.",
            "marisaU0": "Now, now, don't mind me,<br>just keep going about your thief business.",
            "sakuyaU0": "Amazing! I didn't know you were such a good juggler!",
            "sakuyaU1": "Are you a stage magician?<br>Next time, I want to see you cut a body in half.",
            "youmuU0": "Oh, you can even use that sword for pruning?<br>I'd love to dedicate an article to describing it!",
            "aliceU0": "Next time, please let me interview you!<br>I want to see where you put the<br>gunpowder in the dolls!",
            "aliceU1": "Speaking of dolls, have you seen the Hisou Tensoku?<br>That seems to move very much like a doll as well.",
            "patchouliU0": "Ah, yes, why don't I start a \"Lucky Five Elements\"<br>column in my newspaper?<br>Anything's fine.",
            "remiliaU0": "I think articles are more interesting with<br>more aggressive personalities.<br>Why not give it a try?",
            "yuyukoU0": "I don't know if making a seperate newspaper<br>or magazine for the dead is a good idea.",
            "yukariU0": "I'd like to see a newspaper from<br>the outside for reference.<br>Wouldn't tabloids be the most popular?",
            "yukariU1": "A television... guide?<br>I don't know what that is but it sounds interesting!",
            "suikaU0": "It seems like fun underground.<br>You think we can live underground too?",
            "suikaR0": {
                "0": "Even though you're active,<br>I can't imagine you starting up incidents.",
                "1": "Are you hiding something?"
            },
            "aya0": "I can't write about myself in my own newspaper.<br>It would have to be done by a third party.",
            "udongeU0": "I think it speaks volumes about the quality<br>of my newspaper if I have to resort to<br>writing about rabbits now...",
            "komachiU0": "The \"Next Week's Deceased Corner\" was unpopular.<br>It didn't seem to be very accurate.",
            "ikuU0": "Just as I thought, it's possible to<br>predict earthquakes, isn't it?<br>I'm very interested in that.",
            "ikuU1": "The article on the habitual behaviors of the oarfish<br>was a hit with the intellectuals.<br>Even though I just filled it with imagination.",
            "tenshiU0": "I'm dying to know just how bad<br>the fabled poor cuisine of Heaven is.",
            "tenshiU1": "Do the Celestials not read my newspaper?<br>Haven't you heard about the saying<br>\"Voice of Heaven and Speech of Man\"?",
            "sanaeU0": "Ah, the miko with no news.<br>Still running errands for<br>the good of the mountain these days?",
            "chirnoU0": "Actually, I think fairies are the most interesting.<br>And the one over there is the most interesting of<br>the fairies.",
            "meirinU0": "I have a lot to thank the Scarlet Devil Mansion for.<br>Providing scoops, and mass subscriptions, too.",
            "utsuhoU0": "The hot spring beneath the mountain was a success.<br>With it, you improved the mountain's economy.<br>Just as expected from nuclear fusion!",
            "suwakoU0": "So you were there one who thought<br>of the idea of the Hisou Tensoku?<br>How does it work?",
            "common0": "Extra~ Extra~<br>Nothing big happened, but it's still an extra!",
            "common1": "Hello, I'm the well known Miss Shameimaru.<br>I've come to bring you today's newspaper."
        },

        "chirno": {
            "reimuU0": "Man, there've been more shrine maidens lately...<br>but they're no different!",
            "marisaU0": "I can even freeze magicians!",
            "sakuyaU0": "I don't wanna work in a mansion like that!",
            "youmuU0": "I don't really get along well with ghosts...",
            "AliceU0": "Uhhh, have we met somewhere?<br>Can't remember...",
            "AliceU1": "You keep your dolls close to your heart!<br>You won't find any gaps in a fairy like that!",
            "patchouliU0": "Your surroundings are full of unnatural naturalness!",
            "remiliaU0": "Don't you make a lot of useless movements? Hehe.",
            "yuyukoU0": "You ghosts sure are crazy...",
            "yukariU0": "That's it, isn't it? You're just pretending<br>to understand those hard-to-understand<br>things you say, aren't you?",
            "suika0": "What's this?<br>It's got such a captivating smell...",
            "ayaU0": "Write more articles!<br>It doesn't matter if there's<br>stuff to write about or not!",
            "udongeU0": "Huh? Shouldn't you be turning brown<br>for the summer, rabbit?",
            "komachiU0": "Fear death?!<br>Not with that lame scythe!",
            "ikuU0": "Ice clings to your body<br>when you're in the clouds...<br>I hate that!",
            "tenshiU0": "If you're going to pickle veggies,<br>do it before you eat them!<br>But you don't need to pickle a rock.",
            "sanaeU0": "Man, a shrine maiden again!<br>All shrine maidens do is exterminate youkai!",
            "chirnoU0": "Check it out! That's why I'm the strongest!",
            "meirinU0": "In my hands, even a lotus falls apart!",
            "UtsuhoU0": "Gyaaah!",
            "UtsuhoR0": {
                "0": "Doesn't this mean... I'm stronger than the sun?",
                "1": "Yes!<br>There's no way I can lose!",
                "2": "I'm the strongest, most invincible fairy of all!"
            },
            "SuwakoU0": "Go into hibernation! Sleep in the cold!<br>Y'know? When you freeze a hibernating frog,<br>it doesn't wake up... ever!",
            "common0": "So weak!<br>That was like doing warm-ups before practice!",
            "common1": "I'm gonna have to look for some stronger opponents!",
            "common2": "Even if some things can't be frozen,<br>I've gotta keep my pride!"
        },

        "iku": {
            "reimuU0": "Humans and youkai gather at this shrine. Even though<br>you don't say it's because of your appeal,<br>they still gather here nevertheless.",
            "marisaU0": "There are some things even a thief<br>shouldn't try to get their hands on.<br>You should be careful when you're out stealing.",
            "sakuyaU0": {
                "0": "The reason nobody feels awkward around<br>a time-stopper like you is because<br>you're so good at cooking.",
                "1": "I wish you'd invite me<br>to dinner too, once in a while."
            },
            "youmuU0": "You'll cut yourself someday if you keep<br>walking around swinging your sword like that.",
            "aliceU0": "I know you're a doll maker, but it's a bit creepy<br>to always make them human shaped.<br>Why not try making rabbits or fish sometime?",
            "patchouliU0": "Shutting yourself in the library is<br>not good for your mental health.",
            "remiliaU0": "If you're too self-centered,<br.you might wear out your welcome someday.",
            "yuyukoU0": "If others can't understand you,<br>10 times out of 10 it's your personality's fault.<br>That's not a good thing, you know?",
            "yukariU0": "To threaten as you become weaker,<br>such is the folly of a haughty youkai.",
            "suikaU0": "Not everybody can enjoy drinking like you do.<br>It's important to take others' tastes<br>into account too, you know.",
            "ayaU0": "A newspaper can't flatter its readers.<br>That's why nobody likes reporters.",
            "udongeU0": "How does someone come to stay with those<br>that seem to resist others?",
            "komachiU0": "An overly familiar attitude can be grating at times.<br>On the other hand, it seems to be your strong point.",
            "iku0": "It seems the danger of earthquakes has faded, but...<br>It's probably best to be prepared, all the same.",
            "tenshiU0": "I don't know if it's because of the earthquake,<br>but there's been rabble emerging from underground.",
            "sanaeU0": "The mountain of youkai which humans do not approach.<br>It is peculiar that you live there.",
            "chirnoU0": "It seems you aren't cold to the core.<br>Passion is always the charm of life.",
            "meirinU0": "Do you suppose the residents of this estate<br>ever thought of seriously closing the gate for good?",
            "utsuhoU0": "You're a raven sealed in the old hell, I see.<br>However there are lots of other things<br>coming from the underground....",
            "suwakoU0": "Gods with abundant faith have power<br>but at the same time lose their freedom to use it.<br>But you can use your power however you like.",
            "common0": "Harmony is to be valued.<br>However, manners are necessary to maintain harmony."
        },

        "komachi": {
            "reimuU0": "Shinto shrines refrain from anything relating to<br>death right? I mean, you don't<br>even hold funerals there...",
            "marisaU0": "It's not exaggerating to say humans who flee<br>from destiny are humans who forfeit being human.",
            "sakuyaU0": "From cooking to washing,<br>cleaning to battling,<br>you're quite hard working.",
            "youmuU0": "Ahh, living in the Netherworld is so much<br>like living in the human world.<br>Dying and ending up in the Netherworld is the best.",
            "aliceU0": "Hanged people become small ghosts,<br>cause the part between<br>their heads and bodies get thin.",
            "patchouliU0": "A book that kills the person<br>whose name was written on it.<br>That'd be a convenient thing to have.",
            "remiliaU0": "You stuff yourself in coffins<br>even though you're not dead?<br>Wow, that sounds tight.",
            "yuyukoU0": "The seasons in the Netherworld sure are interesting.",
            "yuyukoR0": {
                "0": "Speaking of which, my boss said<br>there have been too few reincarnations lately.",
                "1": "When you're not busy, why don't you go look<br>and fix up some appropriate ghosts for me?",
                "2": "What? It's okay if they're only shells,<br>since it's hard for me if there are<br>more humans around here."
            },
            "yukariU0": "If I took you on my boat,<br>I wonder how long I'd have to row?",
            "suikaU0": "Oh, I smell sake.<br>Can't work any more, nope.",
            "ayaU0": "Ooh, the breadth of the Sanzu River...<br>This is interesting news.",
            "ayaR0": {
                "0": "The Ministry of What's Right and What's Wrong<br>also has something like an internal news memo.",
                "1": "The printing technology of the tengu is certainly<br>very similar to that of the oni in Hell, isn't it?",
                "2": "Just who in the heck came up<br>with such technology, huh?"
            },
            "udongeU0": "Even if there's an illusion,<br>it can't interfere with my distance.",
            "komachi0": "It's a good idea to do some self-introspection<br>every now and then, 'cause I'm<br>still alive enough to do it.",
            "ikuU0": "Oh, oarfish are rare.<br>Don't see them much in my river.",
            "tenshiU0": "It's time for a pleasant life!",
            "sanaeU0": "Oh? My expectations were that humans who<br>presumed to speak for the gods themselves<br>would be different somehow...",
            "chirnoU0": "You look so bored.<br>Alright then, I'll be your playmate from now on!",
            "meirinU0": "Living in the house of a devil like this<br>is a pain, right? What, I'm just playing<br>around a little bit. Don't get so angry.",
            "utsuhoU0": "Oh my, you say you are a hell raven of the Old Hell?<br>Why would something that dangerous be aboveground?",
            "utsuhoR0": {
                "0": "The present Hell became a place where oni are<br>well disciplined and injustices only rarely happen.",
                "1": "The oni of Old Hell were in cahoots with the sinners,<br>such that there were even souls who didn't want to<br>leave hell.",
                "2": "You guys should, rather than a Hell like that,<br>try to look for work at the new Hell.<br>How's that sound?"
            },
            "suwakoU0": {
                "0": "The frog who awoke from within the Earth,<br>the snake who undyingly sheds.",
                "1": "In the stages of life and rebirth, both of you<br>can be seen as Gods who've completely transcended<br>the cycle of suffering. Is that right?"
            },
            "common0": "Every lifespan is different.<br>That's why they're always missing something."
        },

        "marisa": {
            "reimuU0": "Being drunk on peace is bad.<br>Everyone's fighting aimlessly.",
            "reimuR0": {
                "0": "Oh yeah, I dug up something at the bazaar.",
                "1": "The Seed of Unknown Form.",
                "2": "Maybe you can still find them lying around Gensokyo."
            },
            "marisa0": "I'm winning 101 matches<br>out of 100 in image training!",
            "sakuyaU0": "You're going to the bazaar? You're too late,<br>almost all the good stuff's gone.",
            "youmuU0": "Though there are seasons in the Netherworld,<br>there aren't any in Higan, huh.",
            "aliceU0": "This sunshine is even making it<br>hot in the forest this year.",
            "aliceU1": "Won't they explode if you leave them out for<br>too long in this heat? Those dolls, that is.",
            "patchouliU0": "You've got waterproof books as well.<br>I bet you could even read those in the bath.",
            "patchouliR0": {
                "0": "Speaking of which, I wrote a book too!",
                "1": "It's bad of me to keep borrowing books,<br>so I'll put my book here at the library this time!",
                "2": "How much will you pay for it?"
            },
            "remiliaU0": "Sorry I always come during the day,<br>I'm asleep at night.",
            "yuyukoU0": "Graveyards were the meccas of summer, yeah.<br>But... what's a mecca?",
            "yukariU0": "How many eels should you eat in the midsummer day?<br>If it's a lamprey eel, one should be enough, I bet.",
            "yukariR0": "However, who decides when midsummer is anyway?",
            "suikaU0": "A cloud is a gathering of things, isn't it?<br>Can't you ride one?",
            "suikaU1": "Gather the ones who have free time for me tonight.<br>When it gets cool after sundown, we'll have a party!",
            "ayaU0": "I've got a good idea for you. Why don't you try<br>putting a weather forecast in the newspaper?<br>Wouldn't that sell?",
            "ayaR0": {
                "0": "With newspapers, you collect the stories yourself<br>so no one else has to go anywhere.",
                "1": "That's convenient, but everyone<br>reading the same thing is boring.",
                "2": "I could beat you at your own game by just<br>walking around myself. Maybe you should try to<br>write a paper like that too, you know?"
            },
            "udongeU0": "Harvesting bamboo is a lot tougher<br>than I thought it would be.<br>It's about as hard as it is to eat.",
            "udongeR0": {
                "0": "I saw that fast-growin' bamboo.",
                "1": "When you run, it's easy to run into them.",
                "2": "Your traps are more dangerous than a cat's."
            },
            "komachiU0": "How about have the kappa make you a motorboat?<br>It'd make your job fun.",
            "komachiR0": {
                "0": "Does your boat sink easily?",
                "1": "No, it's just that I heard that the boats<br>that spirits ride on sink easily.",
                "2": "Maybe it's not for all spirits, just a certain one?"
            },
            "ikuU0": "You're swimming in the clouds?<br>That looks like it feels nice.",
            "tenshiU0": "Living an elegant life in Heaven would be great,<br>unless you're afraid of heights.",
            "sanaeU0": "So you're really starting to get the hang<br>of youkai extermination, huh?",
            "sanaeU1": "If you do nothing but youkai hunting,<br>you might become close to one yourself.",
            "chirnoU0": "Ah, my bad.<br>I actually haven't seen a Daidarabocchi.",
            "meirinU0": "What's it to you if you beat me?<br>I'm not letting you catch up to my skill level.",
            "utsuhoU0": "No, it's just that, it's so hot today.<br>So hot, I could die.",
            "suwakoU0": "Will you spare me some of that sometime?<br>That nuclear energy.",
            "common0": "When nothing happens, everyone stays the same.<br>It's such a boring situation.",
            "common1": "I'm mostly just afraid of not being able to win<br>before the evening rain starts."
        },

        "meirin": {
            "reimuU0": "You really haven't been doing a good job<br>at solving these incidents recently.<br>At least, to me.",
            "marisaU0": "Hey, stop right there!<br>The library's closed for the day!",
            "sakuyaU0": "I'm always just going easy, you see?<br>I won't go easy on you in an official duel.",
            "youmuU0": "Catching a white feather, huh...?<br>That looks kind of cool.<br>Maybe I can practice with you?",
            "AliceU0": "There are many who like to use dolls in their magic.<br>A lot of them are up to no good too.",
            "patchouliU0": "That's why I said we need to<br>prepare for earthquakes!<br>The books will be damaged, too...",
            "remiliaU0": "My, you don't look so well.<br>Is it because it's noon?",
            "remiliaR0": {
                "0": "Ah, that manga was interesting.",
                "1": "So the tengu don't only make newspapers,<br>but those kind of books as well.",
                "2": "Well, I got scolded a bit<br>after I borrowed that manga though."
            },
            "yuyukoU0": "You're... different from a jiangshi, right?",
            "yukariU0": "I felt some odd resistance.<br>What are you wearing underneath your clothes?",
            "suika0": "Sure is hard to fight the little ones.",
            "ayaU0": "I've heard that you can have<br>your soul stolen by a photograph...",
            "udongeU0": "I always get lost in the bamboo forest.<br>Though it's not like I go there often.",
            "komachiU0": "A shinigami? I met one here just now.",
            "ikuU0": "Are you responsible for the lightning as well?<br>Oh, you're not?",
            "tenshiU0": "Oh, so in Heaven they study<br>the classics of my homeland!",
            "sanaeU0": "Eh? I wonder how you might be different<br>from the shrine maiden of the east?",
            "chirnoU0": "My hands are cold...<br>I'll need to be rougher next time.",
            "meirinU0": "One must always improve one's self.",
            "utsuhoU0": "Nuh-uh, that kind of fireball is too dangerous.",
            "suwakoU0": "Hiding in the ground...? Wasn't expecting that.",
            "common0": "Ah, that was easy enough.<br>Without vigorous movement, the body becomes weak.",
            "common1": "Relying on projectiles is a waste.<br>Beating them directly feels better.",
            "common2": "You're all not there yet!<br>You're all children compared to<br>4000 years of history!"
        },

        "patchouli": {
            "reimuU0": "The shrine isn't a good place for using magic.<br>It needs to be more chaotic.",
            "marisaU0": "The essence of magic is to determine the<br>root cause of all things. There's no distinction<br>between science and magic.",
            "sakuyaU0": "Recently, that rat has been doing more damage again.",
            "youmuU0": "Explaining the existence of ghosts with magic,<br>that's a good first step in studying magic.",
            "aliceU0": "Though you're using magical strings to control<br>the dolls, controlling so many is quite a feat.",
            "patchouli0": "However, image-splitting is tiring...",
            "remiliaU0": "You want to go see the kappa's place again?<br>But it's so close to the river.",
            "yuyukoU0": "When humans die they become able to use magic.<br>That is the same as giving up humanity.",
            "yukariU0": "The magic outside sure has advanced.<br>There are too few researchers in Gensokyo.",
            "yukariR0": {
                "0": "After that, there's been various things<br>spurting from the underworld, it seems.",
                "1": "There was something that came out in early spring.<br>Did you notice?"
            },
            "suikaU0": "The eyes of the holly olive leaves are stuck?<br>What a ridiculous line.",
            "ayaU0": "If you want to sort them,<br>tengu are the magician types.<br>They're the same in seeking the truth.",
            "udongeU0": "Seems like those eyes are getting worse.",
            "komachiU0": "The Higan has no day or night, no winter or summer.<br>I wonder what that means.",
            "ikuU0": "Swimming through the clouds sure is convenient.<br>You even get to meet a dragon.",
            "tenshiU0": "Heaven has no weather?<br>So you mean, weather is something that was conjured?",
            "sanaeU0": {
                "0": "Curses base themselves on imitating form.",
                "1": "From the start, they're different from<br>magic which exposes the truth.<br>But I guess in the end they're the same thing."
            },
            "chirnoU0": "Fairies are instances of natural phenomenon.<br>And there are often cases of<br>magic controlling fairies. Hence they are slaves.",
            "meirinU0": "So?<br>Are you properly doing your job?",
            "meirinR0": {
                "0": "Reading manga all the time makes you sleepy.<br>That's because you don't use your head.",
                "1": "When you're sleepy, is it because you're<br>not thinking, or is it that it doesn't<br>require thinking at all?",
                "2": "If you use your head, then you won't become sleepy."
            },
            "utsuhoU0": "So, how does nuclear fusion work?<br>I wonder how it creates energy.",
            "suwakoU0": "The powers that gods use are basically curses, huh?",
            "common0": "The power of magic is like that of science.<br>Meaning, it's at the forefront of the times!",
            "common1": "Ahhh, boiling water with magic today as well."
        },

        "reimu": {
            "reimuU0": "Who're you?",
            "marisaU0": "Sure is hot and boring.<br>Wanna go to the kappa's place afterwards?",
            "marisaU1": "It's hot whether I move or not.<br>I wonder what I should do at a time like this?",
            "marisaR0": {
                "0": "Speaking of which, that unidentified flying youkai",
                "1": "... got converted to Buddhism<br>and is now living at the temple.",
                "2": "I guess the normal youkai<br>really hate the underground."
            },
            "sakuyaU0": "It bothers me that the Scarlet Devil Mansion<br>is always cool. Is there a secret to that?",
            "sakuyaU1": "Tonight is a summer party at the mansion!<br>Can't get enough of those in the summer.",
            "youmuU0": "It's so hot....<br>Mind lending me a ghost or two?",
            "youmuU1": "Would you mind cutting the grass over there?",
            "youmuU2": "Next time, you should come have<br>a test of courage at my place.<br>You'll be frightened by the monsters there.",
            "aliceU0": "Are you holding proper funerals for your dolls?<br>Lots of things can possess something<br>that looks like a human, you know?",
            "aliceR0": {
                "0": "I've heard lots about hair-growing dolls.",
                "1": "Are those controlled by strings as well?<br>Hair by hair."
            },
            "patchouliU0": "It's so hot, I've thought about not moving at all...",
            "remiliaU0": "I've heard that bats aren't birds<br>but actually mammals!",
            "yuyukoU0": "Usually ghosts collect easily<br>in dark and damp places.",
            "yukariU0": "I'm feeling a bit bored, but...",
            "yukariR0": {
                "0": "Don't you think it's peaceful lately?",
                "1": "Feels like the calm before the storm."
            },
            "suikaU0": "I don't know any decent people<br>who like to live underground.",
            "ayaU0": "Why do you show up in the newspaper photos?",
            "ayaR0": {
                "0": "Why do you show up in the newspaper photos?",
                "1": "Can it be that you moved at ultra high speeds<br>after you pressed the shutter?",
                "2": "...and so you managed to photograph yourself?"
            },
            "udongeU0": "Tonight is rabbit stew!",
            "udongeU1": "There seem to be trees called eye drop trees up on<br>the mountain. If your eyes get so horribly red,<br>why don't you try finding them?",
            "komachiU0": "Hello slacker, is it alright<br>for you to loiter around here?",
            "ikuU0": "It's really been coming down in the evening lately.<br>I bet the lightning wouldn't be as bad<br>if you all would settle down.",
            "tenshiU0": "Heaven seems hot.<br>There's no shade to hide from the sun.",
            "tenshiR0": {
                "0": "Heaven seems hot.<br>There's no shade to hide from the sun.",
                "1": "Ah, but the higher you climb the colder it gets.",
                "2": "Would Heaven above the mountain be hot?<br>Or would it be cold?"
            },
            "sanaeU0": "Let's see whose color is<br>more suitable as a shrine maiden!<br>It's a contest of the clothes!",
            "sanaeR0": {
                "0": "Even if you get enough people<br>to open a branch shrine,",
                "1": "everyone needs to donate.<br>Profit is an indication of faith,",
                "2": "so you want more situations where<br>you can exterminate youkai.<br>I guess I need to get some more people too..."
            },
            "chirnoU0": "How stupid.<br>There's no way you can win against me.",
            "meirinU0": "Isn't Tai chi quan just a form of exercise?",
            "utsuhoU0": "I still don't understand this nuclear fusion.<br>Why does it become hot after fusion?",
            "utsuhoU1": "Why does a crow live in the sun?",
            "suwakoU0": "Frogs hibernating to live sure is amazing.",
            "common0": "This year's summer sure is peaceful.<br>It's good to be bored, probably.",
            "common1": "Something usually happens during the summer, though."
        },

        "remilia": {
            "reimuU0": "You had a test of courage at the shrine?<br>Why didn't you call me?",
            "reimuR0": {
                "0": "It seems there's a temple in the village now.",
                "1": "What makes it different from a shrine?"
            },
            "marisaU0": "Ah, man. In the summer, a huge hat like that<br>must be good for blocking sunlight.",
            "sakuyaU0": "So bored.<br>Go bring me someone interesting.",
            "sakuyaR0": {
                "0": "I want to go to the bazaar,<br>but it's on the river plain...",
                "1": "I want to see the Hisou Tensoku..."
            },
            "aliceU0": "Oh, I saw a golem doll.<br>It looked really weak.",
            "patchouliU0": "What, you don't have any manga?<br>These are the only books you have.",
            "remilia0": "Vampires don't have reflections.<br>So this is simply an afterimage.",
            "yuyukoU0": "Until now, I thought of ghosts as just zombies,<br>but you seem different.<br>I wonder where the male mummies are?",
            "yukariU0": "Huh? White or black?<br>Aren't bats always black?",
            "suikaU0": "You know, watermelons look more like<br>slices of meat than grapes.",
            "ayaU0": "Writing is a pain.<br>How do you write so neatly in newspapers?",
            "udongeU0": "Ah, the dumpling maker.<br>I'll take some holy water dumplings.",
            "komachiU0": "Unfortunately, I can't cross the river.<br>Too bad, huh?",
            "ikuU0": "I've heard that oarfish are really rare fish.",
            "ikuR0": {
                "0": "So...",
                "1": "I've heard that oarfish are really rare fish.",
                "2": "Hmmm... I should let Sakuya know as soon as possible.<br>She has a soft spot for rare ingredients."
            },
            "tenshiU0": "Ehh, so other than peaches, you also eat pills?<br>Do you eagerly chew on Jintan and the such?",
            "sanaeU0": "Heh, so just causing wind to blow makes you a god?",
            "chirnoU0": "Fairies are totally useless.",
            "meirinU0": "How was the manga?<br>Was it interesting?",
            "utsuhoU0": "I rather dislike the sun...",
            "suwakoU0": "You seem to be in constant motion.<br>I thought fighting you would be interesting, but...",
            "common0": "Hmm, I can't see anyone to kill time on..."
        },

        "sakuya": {
            "reimuU0": "The shrine really got fixed back<br>to the way it was before.<br>Even though that was a chance to renovate...",
            "marisaU0": "The strange looking mushrooms taste delicious.<br>Appearance is very important to flavor.",
            "sakuya0": "Since I won, tonight's dinner<br>will be Japanese-style.",
            "sakuyaR0": "Since I won...<br>we'll have rice with forest mushrooms tonight.",
            "youmuU0": "If you used that sword for cooking, I'm sure<br>it would make for a performance that<br>would attract many customers.",
            "aliceU0": "Your dolls are filled with gunpowder?<br>That's hardcore.",
            "patchouliU0": "The weather's fine today,<br>it's great whether you go out or not.",
            "patchouliR0": {
                "0": "Can you tell what kind of stone<br>I bought at the bazaar today?",
                "1": "It just looks like an ordinary stone<br>that fell on the dry river bed to me."
            },
            "remiliaU0": "Have you perhaps noticed<br>anything strange at all lately?",
            "remiliaR0": {
                "0": "You're up early lately.",
                "1": "Much preparation needs to be done in the afternoon,<br>so it's better if you'd graciously rest."
            },
            "yuyukoU0": "You're eating even though you're dead,<br>that must make the food chain go wild.",
            "yuyukoR0": {
                "0": "What happens to the dead if<br>they starve themselves in death?",
                "1": "I don't think they'd come back to life.<br>Just become a hungry ghost, perhaps."
            },
            "yukariU0": "Haven't your activities increased lately?<br>That usually means that things<br>are about to get crazy.",
            "suikaU0": "Ah, perfect timing...<br>Could I borrow some sake from you?",
            "suikaR0": {
                "0": "That gourd of limitless sake.",
                "1": "I think it's valuable for more than just drinking.",
                "2": "Why don't we compete with that<br>nuclear energy with alcoholic fuel?"
            },
            "ayaU0": "Newsprint is very convenient to have.<br>It wipes windows clean...",
            "ayaU1": "Where do you do that movable type printing?<br>That mountain isn't that big.",
            "udongeU0": "Being stabbed just a hair deep<br>wouldn't hurt... though, being stabbed in the eye<br>just a hair deep probably would hurt quite a bit.",
            "komachiU0": "If your boat were in the form of a swan,<br>don't you think the River would look so much nicer?",
            "komachiU1": "There are fish I've never seen before<br>living in the Sanzu River.<br>That's right, I should go fishing next time.",
            "ikuU0": "Maybe I should make eel for tonight's dinner...<br>Or maybe I shouldn't.<br>I wonder what made me think that.",
            "ikuR0": {
                "0": "Whenever I find an oarfish<br>I usually find it looking dead.",
                "1": "I even thought they're actually<br>fish from the Sanzu River."
            },
            "tenshiU0": "A peach isn't particularly suited to be anything<br>but dessert... I actually think<br>a ham would be much more appropriate.",
            "tenshiU1": "Heaven's cuisine isn't really that bad.<br>It's only because your tastes<br>have become more refined.",
            "sanaeU0": "How is it?<br>Life in Gensokyo never gets tiring, right?",
            "sanaeU1": "And I thought you might be<br>a better shrine maiden than Reimu.<br>Seems like that's not the case.",
            "chirnoU0": "You're the one who messed up<br>our garden, aren't you?",
            "chirnoR0": {
                "0": "No matter how many times a fairy<br>is defeated, it won't die.",
                "1": "That's why they charge in so recklessly.",
                "2": "I found their thoughtlessness and bravery strange,<br>but now that I've seen you fight,<br>I'm sure I understand."
            },
            "meirinU0": "You can't be a gatekeeper if<br>you're that weak, you know?",
            "meirinU1": "Come now, get back to work.",
            "utsuhoU0": "You're using such high energies just for fireballs.<br>That's such a waste.",
            "suwakoU0": "Frogs... taste like chicken.<br>But I think chickens are easier to catch.",
            "common0": "It seemed so peaceful lately,<br>but there are a lot of people<br>acting behind-the-scenes.",
            "common1": "To deal with thieves, we planted<br>mandrakes in the garden at regular intervals."
        },

        "sanae": {
            "reimuU0": "This kind of destruction happened because you<br>couldn't inspire enough faith.<br>You should present yourself in a more divine manner.",
            "reimuR0": {
                "0": "Yes, after that we pitched in<br>to help build the temple.",
                "1": "I say that, but there really wasn't<br>much for us to do."
            },
            "marisaU0": "Why is it that the Forest of Magic is<br>called the Forest of Magic?<br>Well, old-growth forests are certainly rare but...",
            "sakuyaU0": "It doesn't seem like maids are really denizens<br>of the fantasy world anymore, don't you think?<br>There are many in the streets.",
            "youmuU0": "It's so fun just to imagine what that large<br>marshmallow-looking thing of yours tastes like.",
            "aliceU0": "That's quite a lot of dolls.<br>I admire artisans.",
            "aliceR0": {
                "0": "Can't you make a big doll or something?",
                "1": "Well, I only want to see one but...<br>A life-sized giant robot, that is."
            },
            "patchouliU0": "Oh my heavens, there's books I've seen before!<br>You have books from the outside world too.",
            "patchouliR0": {
                "0": "Ah, this occult magazine...<br>I used to read it often when I was younger.",
                "1": "I was concerned about it because I felt that<br>these kinds of magazines suddenly disappeared<br>after the turn of the century."
            },
            "remiliaU0": "Don't those wings get in the way when you sleep?",
            "yuyukoU0": "Traditional manors sure are nice.<br>I want to live in a big manor too.",
            "yukariU0": "Eh?<br>A giant robot was built in the outside world?",
            "suika0": "That sake, what was it made from?<br>It's incredibly potent...",
            "ayaU0": "Recently, fewer and fewer people are<br>reading newspapers. It almost feels as if<br>it were a relic of a bygone age, right?",
            "udongeU0": "It's okay, humans who catch rabbits to eat them<br>don't even exist any more.",
            "komachiU0": "The Sanzu River or the Chikuma River,<br>which is longer?",
            "ikuU0": "You swim in the clouds?<br>Don't lumps of ice stick to your body?",
            "tenshiU0": "Ah, thank you so much for the refreshing peaches.",
            "sanaeU0": "I wonder how everyone trains~",
            "chirnoU0": "Oh my, I heard fairies were just small fry but...",
            "meirinU0": "Tai chi quan sure is amazing.<br>I've even seen goalkeepers that can do it.",
            "utsuhoU0": "You're good at controlling<br>so much high-power energy.",
            "suwakoU0": "You're fond of taking action from<br>behind the scenes, right? But in that case,<br>I'll have to remain suspicious of you as well.",
            "suwakoU1": "Just a little more... Couldn't you please give me a<br>little more training? Because it seems the residents<br>of Gensokyo like to be self-disciplined.",
            "common0": "Something like winning a match<br>can't be compared to a miracle!",
            "common1": "Truly, anywhere I go, there always seems to be<br>someone wanting to fight.<br>Everyone in Gensokyo seems so rough.",
            "common2": "Fortunes have no credibility if there isn't a fee."
        },

        "suika": {
            "reimuU0": "Why was everyone gathering at the<br>foot of the mountain? Was something there?",
            "marisaU0": "Are you collecting junk?<br>Want me to help? I'm a real junk collector.",
            "sakuyaU0": "What's the point if you can't stick the knives<br>in something? You should try peeling a nice,<br>ripe peach or something!",
            "youmuU0": "Hey, can you take care of horses with<br>that sword, too? Aw, this'll be great!<br>A nice drink and horse skewers are perfect together.",
            "aliceU0": "Hey, how about you build a bigger doll,<br>then show it to me, alright?",
            "patchouliU0": "Hey, hey, if you're gonna fall asleep here,<br>I'll take you somewhere you don't wanna go!",
            "remiliaU0": "Aren't your moves way too flashy?<br>I could probably block you in my sleep.",
            "yuyukoU0": "You're already dead, so why not drink like it?",
            "yukariU0": "Today's a bore too.<br>Come to me with something interesting.",
            "suika0": "No rush, no rush!<br>Break time, break time!",
            "ayaU0": "I wanna hear more about tengu internal affairs...<br>Maybe I'll just drop in and see<br>what's going on some time...",
            "udongeU0": "Your illusions won't work on me when I'm drunk!<br>Drinking brings out my strongest power!",
            "komachiU0": "Hey, thanks for all your work.<br>I wonder if there's someone<br>around here who's gonna die soon?",
            "ikuU0": "But where's the Dragon Palace?<br>Don't tell me it's at the bottom of the sea!",
            "tenshiU0": "This boredom didn't just start recently.<br>The strong are always bored.",
            "sanaeU0": "I thought you were just a quiet shrine maiden,<br>but that's not right at all, is it?",
            "chirnoU0": "I don't need riffraff as opponents.",
            "meirinU0": "Powerless, huh?<br>What if you train your body some more?",
            "utsuhoU0": "Unbelievable! Someone like you<br>was under Satori's home?<br>You sure surprised me!",
            "utsuhoR0": {
                "0": "If she's used to revive the Hell of Blazing Fires,<br>then it could become a new business.",
                "1": "I feel that she'd do a much better job<br>than the tengu. Though the New Hell would<br>criticize it for being too warm."
            },
            "suwakoU0": "Anyway, you sure are something special to be able<br>to go to the underground world whenever you want.",
            "common0": "This is bad.<br>I'm sobering up!"
        },

        "suwako": {
            "reimuU0": "Ahh, I wish you could share some of your<br>recklessness with our Sanae.",
            "marisaU0": "You should visit the shrine<br>on the mountain too sometimes.",
            "sakuyaU0": "Have you offered your thanks to the god of food?<br>You'll get cursed, you know?",
            "youmuU0": "Ghosts better not hang around the shrine~",
            "aliceU0": "Oh? Do you make Oshirasama dolls?",
            "patchouliU0": "If gods lose their power then<br>magic can't be used, you know?",
            "remiliaU0": "There also exist people who believe in bats<br>as good omens. However even with such trivial<br>amounts of faith, one could become a god, right?",
            "yuyukoU0": "Leaving a dead ghost here like this.<br>Maybe there are no gods in the afterlife.",
            "yukariU0": "Oh my, our shrine really doesn't have<br>any cracks you can slip through.",
            "suika0": "Were you a resident of the underworld?<br>It's flourishing now, thanks to nuclear energy.",
            "ayaU0": "I have a feeling that there are many here<br>whose photos have never been taken.",
            "udongeU0": "I heard that there are all kinds of gods<br>where you come from.",
            "komachiU0": "Death is impure~<br>Shinigami are not gods.",
            "ikuU0": "An oarfish?<br>I've seen them dried.",
            "tenshiU0": "Celestials don't count on anything and have<br>no expectations in life. So then, they are always<br>ready to worship properly, right?",
            "sanaeU0": "Train more and more!<br>Until you're so strong that those<br>below the mountain are afraid of you!",
            "chirnoU0": "Frogs are weak against cold.<br>Not going against nature is the<br>most natural way to live.",
            "meirinU0": "We Japanese Gods accept all kinds of followers!<br>Because there's more than 8 million of us<br>we can't really do any rejecting anymore...",
            "utsuhoU0": "Looking good! Looking good! Today, as well, thanks<br>to the straight-forward and honest youkai, nuclear<br>energy is being used for peaceful purposes only.",
            "suwakoU0": "Gods can split themselves infinitely~",
            "suwakoR0": "Ahh, it's a good time to trick those who<br>live aboveground into confronting<br>their deepest fears isn't it?",
            "common0": "Destroy the evidence! Destroy the evidence!<br>Picking on someone in a place like this<br>can't be good for a god's reputation!",
            "common1": "Now now, there's still more time!<br>Rematch! Rematch!",
            "common2": "Pay more respect to the earth!<br>Otherwise, who knows?<br>You might even get cursed. Heh heh."
        },

        "tenshi": {
            "reimuU0": {
                "0": "You're too straight forward.<br>Compromise makes completeness.",
                "1": "That is, if you bend your ways<br>you can make your life more complete."
            },
            "marisaU0": "Seems like you've become a slave of desire<br>by collecting things. If you want to find joy<br>in life you should cherish the rejection of greed.",
            "sakuyaU0": "No matter how hard you work,<br>all that effort is going the wrong way<br>if you're working under the devil.",
            "youmuU0": "A clean death is no better than a grim life.<br>No matter how dismal your life is, it is better<br>than death. Don't make light of life, ghost.",
            "aliceU0": "If you want your dolls to act in a group, then study<br>the form of water for strategies and tactics.<br>Adaptiveness is the key to victory.",
            "patchouliU0": "You're only reading the scraps of the ancients.<br>The truly important things don't get recorded.",
            "remiliaU0": "It's not good to think that<br>your subordinates will follow you forever.",
            "yuyukoU0": "There's no salvation for a ghost who<br>fills her stomach all day and<br>doesn't use her head for anything!",
            "yukariU0": "The murkiness of the creek has its source.<br>You are the reason why the youkai of Gensokyo<br>are so irresponsible.",
            "suikaU0": "Drinking while half drunk.<br>Getting wasted by binge drinking is the worst.",
            "ayaU0": "Gossip is not wisdom.<br>If they're only written out of curiosity,<br>newspapers make a negative effect on society.",
            "udongeU0": "Leisure and comfort are the ruin of reputation.<br>By seeking peace of heart,<br>I see you are hindering your own growth.",
            "komachiU0": "Good!<br>No matter how many times you come, I won't lose!",
            "komachiR0": {
                "0": "You still have an impudent mouth for a Shinigami.",
                "1": "But it's unsettling the other shinigami more and more."
            },
            "ikuU0": "The geysers seem to be gushing up lately.<br>They don't have anything to do with<br>the keystone, probably.",
            "tenshiU0": "Ah, studying is such a chore...<br>Even if I learn all these things<br>from the ancient people...",
            "sanaeU0": "To boast of one's talents is to lose one's merits,<br>don't you agree? You should be aware that before you<br>were a god, you were a mere human.",
            "chirnoU0": "With passion you forget to eat, with joy<br>you forget your worries. Maybe the lifestyle<br>that Confucius strived for was one like yours.",
            "meirinU0": "Mount Tai does not let its soil run.<br>You should thank the devil who put you here.",
            "utsuhoU0": "Say, you're not related to the earthquake<br>on the surface, right? Right?",
            "utsuhoR0": {
                "0": "You're by yourself?",
                "1": "There were a number of things that<br>came out from the underground.<br>Are they your friends?"
            },
            "suwakoU0": "Virtue is the source of vendetta.<br>Curse Gods originally manifested<br>from divine virtues.",
            "common0": "A celestial descends onto Earth to give advice.<br>Buuuut, for me it's all advice<br>that can't be put to action."
        },

        "udonge": {
            "reimuU0": "Hasn't the shrine been used for a lot of<br>trials of guts at night? I wonder why.",
            "marisaU0": "Even with all your firepower<br>you can't match me, can you?",
            "sakuyaU0": "Even if you stop time, you can't escape<br>from illusions, you know?",
            "sakuyaU1": "Illusions take place within the brain.<Br>In other words, an illusion will<br>beat the speed of light!",
            "youmuU0": "When it comes to illusions, humans get scared by<br>seeing even a third of a ghost. Most of them<br>are 90% sure it was only a hallucination though.",
            "aliceU0": "Did you put eyes in your dolls on purpose?<br>Can the dolls see?",
            "patchouliU0": "You say you have bad eyes?<br>Nah, people with bad eyes can<br>see many different things.",
            "remiliaU0": "However fast you may go, there's no way<br>you can escape from my illusions.",
            "yuyukoU0": "What does the eye of a vengeful spirit see?<br>Why can they attack people?",
            "yukariR0": "The phrase \"parallel world\" comes<br>from a misunderstanding.<br>Maybe it's really the other way around.",
            "yukariR1": {
                "0": "They can see many kinds of small things in the<br>outside world using things like microscopes, right?",
                "1": "It really seems that the act of looking itself<br>can be a large boundary."
            },
            "suikaU0": "Oni...... ehhhh.<Br>Well, I don't see them very often.",
            "ayaU0": "I heard there's modern weaponry<br>being developed in the mountains.<br>Ridiculous!",
            "udonge0": "Ah, red eyes again...<br>Maybe I haven't had enough sleep.",
            "komachiU0": "A shinigami who slacks on the job<br>is a sign of peace...<br>Is that really right?",
            "ikuU0": "You can swim through the air like an angel,<br>but your robe looks a bit torn up...",
            "tenshiU0": "Peaches? Wow, how nostalgic.",
            "tenshiU1": "Even Heaven is not at the top of everything.<br>From the moon, it's still on the ground.",
            "sanaeU0": "Mountain-climbing is such a drag.<br>Why build a shrine at the top of the mountain?",
            "chirnoU0": "When you cool things down, you take heat<br>from the surroundings. You probably<br>warm up inside as a result.",
            "meirinU0": "An exercise that's good for your health?<br>Well, I think medicines are better.",
            "utsuhoU0": "Nuclear energy....<br>Such a fearsome power,<br>I'm glad that the user is a moron.",
            "suwakoU0": "As a native god, you shouldn't let your power<br>go to waste. That's what my master said.",
            "common0": {
                "0": "You intended to move straight ahead<br>but from the start, you were dizzy.",
                "1": "Well, you're an earth creature.<br>That's why you lost."
            }
        },

        "utsuho": {
            "reimuU0": "Hey, it's a shrine maiden.<br>I can't tell you shrine maidens<br>apart from one another.",
            "marisaU0": "You couldn't even roast a bird with that firepower.",
            "sakuyaU0": "Techniques that are only fancy tricks<br>are no match for overwhelming power!",
            "youmuU0": "With nuclear fusion you could even<br>practice metallurgy and make a great business of it!",
            "aliceU0": "That doll...<br>I'm sure it can explode even further!",
            "patchouliU0": "You're relying on such pitifully boring magic<br>aren't you. From now on it's nuclear power!<br>The nuclear age!",
            "remiliaU0": "Restlessly moving around non-stop<br>isn't going to change a thing!<br>I'm not looking at you anyway.",
            "yuyukoU0": "I'm someone who's become used to vengeful spirits,<br>so normal spirits are refreshing.",
            "yuyukoR0": {
                "0": "Vengeful spirits...",
                "1": "They have good manners,<br>but their true nature makes<br>them painful to deal with.",
                "2": "Well, it's the fate of those who go to Hell:<br>even after becoming vengeful spirits,<br>they still continue to be burned."
            },
            "yukariU0": "Eh? There are many people outside who terribly<br>misunderstand nuclear energy and disapprove<br>of its use? Even though it's so useful...",
            "suika0": "It's okay, the Underground City can prosper.<br>After all, the only weakness the underground had<br>was that it didn't have a sun!",
            "ayaU0": "I'm sorry, I hardly ever read newspapers.",
            "udongeU0": "Eh? There's something even more awesome<br>than nuclear energy?",
            "komachiU0": "I wonder what's become of the new Hell?<br>I really want to take a peek.",
            "ikuU0": "Wow, there was a sea above the clouds too,<br>wasn't there!?",
            "tenshiU0": "So you're the one who used the keystone.<br>It looks like it's holding the<br>Lord of the Earth back like it should.",
            "sanaeU0": "Hey, it's a shrine maiden.<br>I can't tell you shrine maidens<br>apart from one another.",
            "chirnoU0": "Wait, what? You didn't get blasted to smithereens.<br>Was the output too low...?",
            "meirinU0": "You're always trying to close in on me.<br>Are you trying to burn yourself to death?",
            "utsuhoU0": "The sun continues to burn today.",
            "suwakoU0": "Ah yes, the energetic hydrogen atoms are<br>fusing magnificently today as well!",
            "common0": "Nobody can withstand the ultimate energy!",
            "common1": "This still isn't enough to stop this<br>surging feeling! The nuclear reactions within me<br>force me to rage even more!",
            "common2": "Compared to the Sun, you are but a puny existence.<br>But I won't show any sympathy!"
        },

        "youmu": {
            "reimuU0": "They say that the blade rusts because<br>of the iron in blood.",
            "marisaU0": "Your mind is too clouded.<br>You know you won't die<br>a good death like this, right?",
            "sakuyaU0": {
                "0": "Japanese swords are specialized for slashing.<br>They're much more refined than<br>knives meant for stabbing.",
                "1": "It is possible to hit the knife with the sword.<br>If you persevere, you can even cut a barrage of them."
            },
            "youmu0": "Now then, today's training is done.",
            "aliceU0": "To shoot a general, aim for his mount.<br>Even if I slash between you and the dolls,<br>the strings won't break...",
            "patchouliU0": "If I concentrate then I can even<br>cut streams of energy. It's meaningless no matter<br>how many formations you set up.",
            "remiliaU0": {
                "0": "Lady Yuyuko said<br>\"Against agile opponents,<br>you should shut your eyes.\"",
                "1": "Is it because you don't see the afterimages<br>when your eyes are shut?"
            },
            "remiliaU1": "My sword can easily cut through<br>opponents like you.",
            "yuyukoU0": "Lady Yuyuko, why don't you train sword techniques<br>with me sometimes?<br>It'll settle your spirits, you know?",
            "yuyukoR0": {
                "0": "Oh right, about the things<br>I had pickled before...",
                "1": "Strangely, I leave them out for days or years<br>but they don't ever change much.",
                "2": "And to think the food at the shrine<br>becomes delicious after one day of pickling...."
            },
            "yuyukoR1": {
                "0": "It seems that thing flying in the air<br>early spring was a treasure ship in the end.",
                "1": "I didn't really understand after hearing<br>from Reimu and the others, but ...",
                "2": "I'm glad it wasn't a boat that could cause us harm."
            },
            "yukariU0": "Anyways, is it okay to keep the boundary between<br>this world and the next ambiguous like this?",
            "suikaU0": "Seems like blades that cut oni are special.<br>Well, my blade is special too.",
            "ayaU0": "Is it really okay for a newspaper reporter<br>to interfere with their photo subjects like that?",
            "udongeU0": "Does a red-eyed rabbit see<br>the world in red?",
            "komachiU0": "Won't you help the children by the Sanzu River?<br>I always worry about them crossing to the other side.",
            "ikuU0": "Why are you swimming in the sky?<br>Are you dieting?",
            "tenshiU0": "Looks to me that Heaven isn't saturated at all.<br>The Netherworld is far more crowded<br>if this is all there is.",
            "tenshiU1": "You didn't fly around in early spring?<br>I saw this big ship-like thing.",
            "sanaeU0": "Ohhh, so there are shrines in the outside world too?<br>I thought they were already a lost culture.",
            "chirnoU0": "Rough ice requires more power to break<br>so it's harder to cut it.",
            "meirinU0": "You don't use the Green Dragon Blade?<br>I've heard so much about it.",
            "utsuhoU0": "It explodes, but it's fusing together... ???<br>How can that be?",
            "suwakoU0": "Are you the god on top of the mountain?<br>You sure don't look like it.",
            "common0": "If a sword's been used to cut so much that<br>it became tainted with clotted blood, it's useless.",
            "common1": "If there is something I can't make clear,<br>I try cutting it!"
        },

        "yukari": {
            "reimuU0": "When you drink sake, do you swallow the cup?<br>Or, do you swallow the liquid inside it?",
            "marisaU0": "Plants use capillary motion to suck water up<br>from their roots. Do your best to keep the plants<br>that have lost their roots moist.",
            "sakuyaU0": "Even if you stop time,<br>spilt milk can't be recovered.<br>Should you fill your cup with milk?",
            "youmuU0": "Every tree and blade of grass is<br>as precious as the Buddha.<br>Unfortunately, this doesn't include humans.",
            "aliceU0": "A heart dwelling within a human-shaped object.<br>How is that different from a youkai, I wonder?",
            "patchouli0": "The magic of the outside world is not so primitive.<br>Now, there are even things like giant robots.",
            "remiliaU0": "That bat you saw, was it white?<br>Or was it black?",
            "yuyukoU0": "I'm busy lately.<br>I'm busy like it's peacetime!",
            "yukariU0": "Oh, the mirror world.",
            "yukari0": {
                "0": "The mirror world reverses right and left?<br>But up and down don't switch<br>even if I look from the side.",
                "1": "I should look into this more closely..."
            },
            "suikaU0": "Oni are quite impressive, and quite popular.<br>Have you perhaps gathered more faith<br>than the clumsy gods?",
            "ayaU0": "Hearts dwell within human-shaped objects.<br>And photographs are no exception.",
            "udongeU0": "All things on the Earth must eventually die.<br>Do you really understand that?",
            "komachiU0": "Why do you think people<br>cross the river after they die?<br>It's because water cycles itself.",
            "ikuU0": "They say that oarfish can grow<br>to be over 18 meters long.<br>You're pretty tiny.",
            "tenshiU0": "The monkey who arose to the heavens rebelled<br>from his post in rage. In the end,<br>he was imprisoned upon the mountain.",
            "sanaeU0": "How is it?<br>Getting used to this place?",
            "chirnoU0": "I don't think I'd mind working so much<br>if you could cool a wider area at once.",
            "meirinU0": "You living in a red building,<br>that's some kind of joke, right?",
            "utsuhoU0": "Solar power is already not kind to the youkai.<br>However, your power goes too far,<br>to the extent of evil.",
            "suwakoU0": "There are many selfish ones among the gods.<br>I wonder if they don't notice because<br>they are the receivers of faith.",
            "common0": "Ah, the dull...<br>The dull go through so much trouble, don't they?"
        },

        "yuyuko": {
            "reimuU0": "Oh?<br>What business do you have today?",
            "marisaU0": "Why is it that it's so easy to get lost<br>in the forest? Though it's easy to get lost,<br>you don't really get lost....",
            "sakuyaU0": "Time reverses at the extremes and<br>breaks at the fullest. Stopping time at will<br>like that is not a good thing.",
            "youmuU0": "Oh, sword training?<br>I don't care for such an<br>unrefined kind of training, myself.",
            "aliceU0": "Nobody thinks much of the dolls no matter<br>how many of them die. It's wise of you to detonate<br>them before they get possessed by spirits!",
            "patchouliU0": "When it's hot, you drink hot tea.<br>Ufufu, even though you drink<br>hot tea when it's cold too.",
            "remiliaU0": "The sun always rises.<br>Your weak point comes around once every day.",
            "remiliaR0": {
                "0": "Have you realized?",
                "1": "In order to bring you down,<br>a sun has risen from Hell.",
                "2": "Now, how will you react?"
            },
            "yuyuko0": "Fantastic Ninja Art, Clone Technique~",
            "yukariU0": "Ahh, I'm bored.<br>Won't you bring something here?",
            "suikaU0": "Ah, the fireworks are really something this year.<br>What a wonderful sight.",
            "suikaR0": {
                "0": "Speaking of summer activities...",
                "1": "It must be that game where you cover your eyes<br>and smash something with a club.",
                "2": "Suika-bashing."
            },
            "aya0": "A newspaper for ghosts seems<br>like it would be interesting.<br>How about it; want to try making one?",
            "udonge0": "Animals that eat nothing but bamboo grass...<br>No way.",
            "komachiU0": "Ah, looking for passengers this far out?<br>You sure are passionate about your work.",
            "ikuU0": "Will we need another earthquake to<br>set the ground straight?",
            "tenshiU0": "I'd like to drink that nectar sometime.<br>It's supposed to have a sweet flavor, right?",
            "sanaeU0": "This year you've been moving here and there.<br>Did something happen?",
            "chirnoU0": "Ah, that's all I have for you this summer.<br>Having cool things in the summer is important.",
            "meirinU0": "Tai chi quan goes well with paper fans, it seems.",
            "utsuhoU0": "Ahh, one sun is enough,<br>especially in this summer heat!",
            "suwakoU0": "Goodness me, you are a god. Recently, I haven't<br>been able to tell whether the shrine maidens<br>or the gods are the slaves...",
            "suwakoR0": {
                "0": "The shrine over there...<br>doesn't it get crowded with three gods in it?",
                "1": "Hakugyokurou is many times bigger than that,<br>but it still feels cramped.",
                "2": "Ahh, I see. You've got no money.<br>Shrines are like that."
            },
            "common0": "Huh? No fair, finishing so soon."
        }
    }
}